Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : ACCESSCTRL
// Version        : 1
// Bus type       : apb
// Description    : Hardware access control registers
// =============================================================================
#ifndef _HARDWARE_REGS_ACCESSCTRL_H
#define _HARDWARE_REGS_ACCESSCTRL_H
// =============================================================================
// Register    : ACCESSCTRL_LOCK
// Description : Once a LOCK bit is written to 1, ACCESSCTRL silently ignores
//               writes from that master. LOCK is writable only by a Secure,
//               Privileged processor or debugger.
//
//               LOCK bits are only writable when their value is zero. Once set,
//               they can never be cleared, except by a full reset of ACCESSCTRL
//
//               Setting the LOCK bit does not affect whether an access raises a
//               bus error. Unprivileged writes, or writes from the DMA, will
//               continue to raise bus errors. All other accesses will continue
//               not to.
#define ACCESSCTRL_LOCK_OFFSET _u(0x00000000)
#define ACCESSCTRL_LOCK_BITS   _u(0x0000000f)
#define ACCESSCTRL_LOCK_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_LOCK_DEBUG
#define ACCESSCTRL_LOCK_DEBUG_RESET  _u(0x0)
#define ACCESSCTRL_LOCK_DEBUG_BITS   _u(0x00000008)
#define ACCESSCTRL_LOCK_DEBUG_MSB    _u(3)
#define ACCESSCTRL_LOCK_DEBUG_LSB    _u(3)
#define ACCESSCTRL_LOCK_DEBUG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_LOCK_DMA
#define ACCESSCTRL_LOCK_DMA_RESET  _u(0x1)
#define ACCESSCTRL_LOCK_DMA_BITS   _u(0x00000004)
#define ACCESSCTRL_LOCK_DMA_MSB    _u(2)
#define ACCESSCTRL_LOCK_DMA_LSB    _u(2)
#define ACCESSCTRL_LOCK_DMA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_LOCK_CORE1
#define ACCESSCTRL_LOCK_CORE1_RESET  _u(0x0)
#define ACCESSCTRL_LOCK_CORE1_BITS   _u(0x00000002)
#define ACCESSCTRL_LOCK_CORE1_MSB    _u(1)
#define ACCESSCTRL_LOCK_CORE1_LSB    _u(1)
#define ACCESSCTRL_LOCK_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_LOCK_CORE0
#define ACCESSCTRL_LOCK_CORE0_RESET  _u(0x0)
#define ACCESSCTRL_LOCK_CORE0_BITS   _u(0x00000001)
#define ACCESSCTRL_LOCK_CORE0_MSB    _u(0)
#define ACCESSCTRL_LOCK_CORE0_LSB    _u(0)
#define ACCESSCTRL_LOCK_CORE0_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_FORCE_CORE_NS
// Description : Force core 1's bus accesses to always be Non-secure, no matter
//               the core's internal state.
//
//               Useful for schemes where one core is designated as the Non-
//               secure core, since some peripherals may filter individual
//               registers internally based on security state but not on master
//               ID.
#define ACCESSCTRL_FORCE_CORE_NS_OFFSET _u(0x00000004)
#define ACCESSCTRL_FORCE_CORE_NS_BITS   _u(0x00000002)
#define ACCESSCTRL_FORCE_CORE_NS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_FORCE_CORE_NS_CORE1
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_RESET  _u(0x0)
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_BITS   _u(0x00000002)
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_MSB    _u(1)
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_LSB    _u(1)
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_CFGRESET
// Description : Write 1 to reset all ACCESSCTRL configuration, except for the
//               LOCK and FORCE_CORE_NS registers.
//
//               This bit is used in the RP2350 bootrom to quickly restore
//               ACCESSCTRL to a known state during the boot path.
//
//               Note that, like all registers in ACCESSCTRL, this register is
//               not writable when the writer's corresponding LOCK bit is set,
//               therefore a master which has been locked out of ACCESSCTRL can
//               not use the CFGRESET register to disturb its contents.
#define ACCESSCTRL_CFGRESET_OFFSET _u(0x00000008)
#define ACCESSCTRL_CFGRESET_BITS   _u(0x00000001)
#define ACCESSCTRL_CFGRESET_RESET  _u(0x00000000)
#define ACCESSCTRL_CFGRESET_MSB    _u(0)
#define ACCESSCTRL_CFGRESET_LSB    _u(0)
#define ACCESSCTRL_CFGRESET_ACCESS "SC"
// =============================================================================
// Register    : ACCESSCTRL_GPIO_NSMASK0
// Description : Control whether GPIO0...31 are accessible to Non-secure code.
//               Writable only by a Secure, Privileged processor or debugger.
//
//               0 -> Secure access only
//
//               1 -> Secure + Non-secure access
#define ACCESSCTRL_GPIO_NSMASK0_OFFSET _u(0x0000000c)
#define ACCESSCTRL_GPIO_NSMASK0_BITS   _u(0xffffffff)
#define ACCESSCTRL_GPIO_NSMASK0_RESET  _u(0x00000000)
#define ACCESSCTRL_GPIO_NSMASK0_MSB    _u(31)
#define ACCESSCTRL_GPIO_NSMASK0_LSB    _u(0)
#define ACCESSCTRL_GPIO_NSMASK0_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_GPIO_NSMASK1
// Description : Control whether GPIO32..47 are accessible to Non-secure code,
//               and whether QSPI and USB bitbang are accessible through the
//               Non-secure SIO. Writable only by a Secure, Privileged processor
//               or debugger.
#define ACCESSCTRL_GPIO_NSMASK1_OFFSET _u(0x00000010)
#define ACCESSCTRL_GPIO_NSMASK1_BITS   _u(0xff00ffff)
#define ACCESSCTRL_GPIO_NSMASK1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_SD
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_RESET  _u(0x0)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_BITS   _u(0xf0000000)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_MSB    _u(31)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_LSB    _u(28)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_RESET  _u(0x0)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_BITS   _u(0x08000000)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_MSB    _u(27)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_LSB    _u(27)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_RESET  _u(0x0)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_BITS   _u(0x04000000)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_MSB    _u(26)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_LSB    _u(26)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_USB_DM
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_RESET  _u(0x0)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_BITS   _u(0x02000000)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_MSB    _u(25)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_LSB    _u(25)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_USB_DP
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_RESET  _u(0x0)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_BITS   _u(0x01000000)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_MSB    _u(24)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_LSB    _u(24)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_GPIO_NSMASK1_GPIO
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_RESET  _u(0x0000)
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_BITS   _u(0x0000ffff)
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_MSB    _u(15)
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_LSB    _u(0)
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_ROM
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               ROM, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_ROM_OFFSET _u(0x00000014)
#define ACCESSCTRL_ROM_BITS   _u(0x000000ff)
#define ACCESSCTRL_ROM_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_DBG
// Description : If 1, ROM can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_ROM_DBG_RESET  _u(0x1)
#define ACCESSCTRL_ROM_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_ROM_DBG_MSB    _u(7)
#define ACCESSCTRL_ROM_DBG_LSB    _u(7)
#define ACCESSCTRL_ROM_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_DMA
// Description : If 1, ROM can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROM_DMA_RESET  _u(0x1)
#define ACCESSCTRL_ROM_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_ROM_DMA_MSB    _u(6)
#define ACCESSCTRL_ROM_DMA_LSB    _u(6)
#define ACCESSCTRL_ROM_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_CORE1
// Description : If 1, ROM can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROM_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_ROM_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_ROM_CORE1_MSB    _u(5)
#define ACCESSCTRL_ROM_CORE1_LSB    _u(5)
#define ACCESSCTRL_ROM_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_CORE0
// Description : If 1, ROM can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROM_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_ROM_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_ROM_CORE0_MSB    _u(4)
#define ACCESSCTRL_ROM_CORE0_LSB    _u(4)
#define ACCESSCTRL_ROM_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_SP
// Description : If 1, ROM can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_ROM_SP_RESET  _u(0x1)
#define ACCESSCTRL_ROM_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_ROM_SP_MSB    _u(3)
#define ACCESSCTRL_ROM_SP_LSB    _u(3)
#define ACCESSCTRL_ROM_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_SU
// Description : If 1, and SP is also set, ROM can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_ROM_SU_RESET  _u(0x1)
#define ACCESSCTRL_ROM_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_ROM_SU_MSB    _u(2)
#define ACCESSCTRL_ROM_SU_LSB    _u(2)
#define ACCESSCTRL_ROM_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_NSP
// Description : If 1, ROM can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_ROM_NSP_RESET  _u(0x1)
#define ACCESSCTRL_ROM_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_ROM_NSP_MSB    _u(1)
#define ACCESSCTRL_ROM_NSP_LSB    _u(1)
#define ACCESSCTRL_ROM_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROM_NSU
// Description : If 1, and NSP is also set, ROM can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_ROM_NSU_RESET  _u(0x1)
#define ACCESSCTRL_ROM_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_ROM_NSU_MSB    _u(0)
#define ACCESSCTRL_ROM_NSU_LSB    _u(0)
#define ACCESSCTRL_ROM_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_XIP_MAIN
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               XIP_MAIN, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_XIP_MAIN_OFFSET _u(0x00000018)
#define ACCESSCTRL_XIP_MAIN_BITS   _u(0x000000ff)
#define ACCESSCTRL_XIP_MAIN_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_DBG
// Description : If 1, XIP_MAIN can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_MAIN_DBG_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_XIP_MAIN_DBG_MSB    _u(7)
#define ACCESSCTRL_XIP_MAIN_DBG_LSB    _u(7)
#define ACCESSCTRL_XIP_MAIN_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_DMA
// Description : If 1, XIP_MAIN can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_MAIN_DMA_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_XIP_MAIN_DMA_MSB    _u(6)
#define ACCESSCTRL_XIP_MAIN_DMA_LSB    _u(6)
#define ACCESSCTRL_XIP_MAIN_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_CORE1
// Description : If 1, XIP_MAIN can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_MAIN_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_XIP_MAIN_CORE1_MSB    _u(5)
#define ACCESSCTRL_XIP_MAIN_CORE1_LSB    _u(5)
#define ACCESSCTRL_XIP_MAIN_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_CORE0
// Description : If 1, XIP_MAIN can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_MAIN_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_XIP_MAIN_CORE0_MSB    _u(4)
#define ACCESSCTRL_XIP_MAIN_CORE0_LSB    _u(4)
#define ACCESSCTRL_XIP_MAIN_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_SP
// Description : If 1, XIP_MAIN can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_XIP_MAIN_SP_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_XIP_MAIN_SP_MSB    _u(3)
#define ACCESSCTRL_XIP_MAIN_SP_LSB    _u(3)
#define ACCESSCTRL_XIP_MAIN_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_SU
// Description : If 1, and SP is also set, XIP_MAIN can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_XIP_MAIN_SU_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_XIP_MAIN_SU_MSB    _u(2)
#define ACCESSCTRL_XIP_MAIN_SU_LSB    _u(2)
#define ACCESSCTRL_XIP_MAIN_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_NSP
// Description : If 1, XIP_MAIN can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_XIP_MAIN_NSP_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_XIP_MAIN_NSP_MSB    _u(1)
#define ACCESSCTRL_XIP_MAIN_NSP_LSB    _u(1)
#define ACCESSCTRL_XIP_MAIN_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_MAIN_NSU
// Description : If 1, and NSP is also set, XIP_MAIN can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_XIP_MAIN_NSU_RESET  _u(0x1)
#define ACCESSCTRL_XIP_MAIN_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_XIP_MAIN_NSU_MSB    _u(0)
#define ACCESSCTRL_XIP_MAIN_NSU_LSB    _u(0)
#define ACCESSCTRL_XIP_MAIN_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM0, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM0_OFFSET _u(0x0000001c)
#define ACCESSCTRL_SRAM0_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM0_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_DBG
// Description : If 1, SRAM0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM0_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM0_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_DMA
// Description : If 1, SRAM0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM0_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM0_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_CORE1
// Description : If 1, SRAM0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM0_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM0_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_CORE0
// Description : If 1, SRAM0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM0_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM0_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_SP
// Description : If 1, SRAM0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM0_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM0_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM0_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_SU
// Description : If 1, and SP is also set, SRAM0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM0_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM0_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM0_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_NSP
// Description : If 1, SRAM0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM0_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM0_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM0_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM0_NSU
// Description : If 1, and NSP is also set, SRAM0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM0_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM0_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM0_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM1, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM1_OFFSET _u(0x00000020)
#define ACCESSCTRL_SRAM1_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM1_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_DBG
// Description : If 1, SRAM1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM1_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM1_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_DMA
// Description : If 1, SRAM1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM1_DMA_MSB    _u(6)
