Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_SRAM1_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_CORE1
// Description : If 1, SRAM1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM1_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM1_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_CORE0
// Description : If 1, SRAM1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM1_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM1_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_SP
// Description : If 1, SRAM1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM1_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM1_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM1_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_SU
// Description : If 1, and SP is also set, SRAM1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM1_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM1_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM1_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_NSP
// Description : If 1, SRAM1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM1_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM1_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM1_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM1_NSU
// Description : If 1, and NSP is also set, SRAM1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM1_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM1_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM1_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM2
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM2, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM2_OFFSET _u(0x00000024)
#define ACCESSCTRL_SRAM2_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM2_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_DBG
// Description : If 1, SRAM2 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM2_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM2_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM2_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM2_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_DMA
// Description : If 1, SRAM2 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM2_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM2_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM2_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM2_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_CORE1
// Description : If 1, SRAM2 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM2_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM2_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM2_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM2_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_CORE0
// Description : If 1, SRAM2 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM2_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM2_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM2_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM2_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_SP
// Description : If 1, SRAM2 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM2_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM2_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM2_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM2_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_SU
// Description : If 1, and SP is also set, SRAM2 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM2_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM2_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM2_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM2_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_NSP
// Description : If 1, SRAM2 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM2_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM2_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM2_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM2_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM2_NSU
// Description : If 1, and NSP is also set, SRAM2 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM2_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM2_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM2_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM2_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM2_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM3
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM3, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM3_OFFSET _u(0x00000028)
#define ACCESSCTRL_SRAM3_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM3_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_DBG
// Description : If 1, SRAM3 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM3_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM3_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM3_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM3_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_DMA
// Description : If 1, SRAM3 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM3_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM3_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM3_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM3_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_CORE1
// Description : If 1, SRAM3 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM3_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM3_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM3_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM3_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_CORE0
// Description : If 1, SRAM3 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM3_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM3_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM3_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM3_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_SP
// Description : If 1, SRAM3 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM3_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM3_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM3_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM3_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_SU
// Description : If 1, and SP is also set, SRAM3 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM3_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM3_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM3_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM3_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_NSP
// Description : If 1, SRAM3 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM3_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM3_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM3_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM3_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM3_NSU
// Description : If 1, and NSP is also set, SRAM3 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM3_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM3_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM3_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM3_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM3_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM4
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM4, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM4_OFFSET _u(0x0000002c)
#define ACCESSCTRL_SRAM4_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM4_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_DBG
// Description : If 1, SRAM4 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM4_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM4_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM4_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM4_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_DMA
// Description : If 1, SRAM4 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM4_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM4_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM4_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM4_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_CORE1
// Description : If 1, SRAM4 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM4_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM4_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM4_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM4_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_CORE0
// Description : If 1, SRAM4 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM4_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM4_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM4_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM4_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_SP
// Description : If 1, SRAM4 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM4_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM4_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM4_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM4_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_SU
// Description : If 1, and SP is also set, SRAM4 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM4_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM4_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM4_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM4_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_NSP
// Description : If 1, SRAM4 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM4_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM4_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM4_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM4_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM4_NSU
// Description : If 1, and NSP is also set, SRAM4 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM4_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM4_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM4_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM4_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM4_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM5
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM5, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM5_OFFSET _u(0x00000030)
#define ACCESSCTRL_SRAM5_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM5_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_DBG
// Description : If 1, SRAM5 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM5_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM5_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM5_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM5_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_DMA
// Description : If 1, SRAM5 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM5_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM5_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM5_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM5_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_CORE1
// Description : If 1, SRAM5 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM5_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM5_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM5_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM5_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_CORE0
// Description : If 1, SRAM5 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM5_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM5_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM5_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM5_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_SP
// Description : If 1, SRAM5 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM5_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM5_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM5_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM5_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_SU
// Description : If 1, and SP is also set, SRAM5 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM5_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM5_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM5_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM5_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_NSP
// Description : If 1, SRAM5 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM5_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM5_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM5_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM5_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM5_NSU
// Description : If 1, and NSP is also set, SRAM5 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM5_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM5_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM5_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM5_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM5_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM6
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM6, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM6_OFFSET _u(0x00000034)
#define ACCESSCTRL_SRAM6_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM6_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_DBG
// Description : If 1, SRAM6 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM6_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM6_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM6_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM6_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_DMA
// Description : If 1, SRAM6 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM6_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM6_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM6_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM6_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_CORE1
// Description : If 1, SRAM6 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM6_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM6_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM6_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM6_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_CORE0
// Description : If 1, SRAM6 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM6_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM6_CORE0_MSB    _u(4)
