Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_SRAM6_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM6_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_SP
// Description : If 1, SRAM6 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM6_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM6_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM6_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM6_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_SU
// Description : If 1, and SP is also set, SRAM6 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM6_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM6_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM6_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM6_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_NSP
// Description : If 1, SRAM6 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM6_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM6_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM6_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM6_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM6_NSU
// Description : If 1, and NSP is also set, SRAM6 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM6_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM6_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM6_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM6_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM6_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM7
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM7, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM7_OFFSET _u(0x00000038)
#define ACCESSCTRL_SRAM7_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM7_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_DBG
// Description : If 1, SRAM7 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM7_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM7_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM7_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM7_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_DMA
// Description : If 1, SRAM7 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM7_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM7_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM7_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM7_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_CORE1
// Description : If 1, SRAM7 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM7_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM7_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM7_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM7_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_CORE0
// Description : If 1, SRAM7 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM7_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM7_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM7_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM7_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_SP
// Description : If 1, SRAM7 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM7_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM7_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM7_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM7_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_SU
// Description : If 1, and SP is also set, SRAM7 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM7_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM7_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM7_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM7_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_NSP
// Description : If 1, SRAM7 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM7_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM7_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM7_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM7_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM7_NSU
// Description : If 1, and NSP is also set, SRAM7 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM7_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM7_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM7_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM7_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM7_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM8
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM8, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM8_OFFSET _u(0x0000003c)
#define ACCESSCTRL_SRAM8_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM8_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_DBG
// Description : If 1, SRAM8 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM8_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM8_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM8_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM8_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_DMA
// Description : If 1, SRAM8 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM8_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM8_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM8_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM8_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_CORE1
// Description : If 1, SRAM8 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM8_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM8_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM8_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM8_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_CORE0
// Description : If 1, SRAM8 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM8_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM8_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM8_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM8_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_SP
// Description : If 1, SRAM8 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM8_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM8_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM8_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM8_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_SU
// Description : If 1, and SP is also set, SRAM8 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM8_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM8_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM8_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM8_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_NSP
// Description : If 1, SRAM8 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM8_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM8_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM8_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM8_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM8_NSU
// Description : If 1, and NSP is also set, SRAM8 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM8_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM8_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM8_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM8_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM8_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SRAM9
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SRAM9, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SRAM9_OFFSET _u(0x00000040)
#define ACCESSCTRL_SRAM9_BITS   _u(0x000000ff)
#define ACCESSCTRL_SRAM9_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_DBG
// Description : If 1, SRAM9 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SRAM9_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SRAM9_DBG_MSB    _u(7)
#define ACCESSCTRL_SRAM9_DBG_LSB    _u(7)
#define ACCESSCTRL_SRAM9_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_DMA
// Description : If 1, SRAM9 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM9_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SRAM9_DMA_MSB    _u(6)
#define ACCESSCTRL_SRAM9_DMA_LSB    _u(6)
#define ACCESSCTRL_SRAM9_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_CORE1
// Description : If 1, SRAM9 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM9_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SRAM9_CORE1_MSB    _u(5)
#define ACCESSCTRL_SRAM9_CORE1_LSB    _u(5)
#define ACCESSCTRL_SRAM9_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_CORE0
// Description : If 1, SRAM9 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SRAM9_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SRAM9_CORE0_MSB    _u(4)
#define ACCESSCTRL_SRAM9_CORE0_LSB    _u(4)
#define ACCESSCTRL_SRAM9_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_SP
// Description : If 1, SRAM9 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SRAM9_SP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SRAM9_SP_MSB    _u(3)
#define ACCESSCTRL_SRAM9_SP_LSB    _u(3)
#define ACCESSCTRL_SRAM9_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_SU
// Description : If 1, and SP is also set, SRAM9 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SRAM9_SU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SRAM9_SU_MSB    _u(2)
#define ACCESSCTRL_SRAM9_SU_LSB    _u(2)
#define ACCESSCTRL_SRAM9_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_NSP
// Description : If 1, SRAM9 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SRAM9_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SRAM9_NSP_MSB    _u(1)
#define ACCESSCTRL_SRAM9_NSP_LSB    _u(1)
#define ACCESSCTRL_SRAM9_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SRAM9_NSU
// Description : If 1, and NSP is also set, SRAM9 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SRAM9_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SRAM9_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SRAM9_NSU_MSB    _u(0)
#define ACCESSCTRL_SRAM9_NSU_LSB    _u(0)
#define ACCESSCTRL_SRAM9_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_DMA
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               DMA, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_DMA_OFFSET _u(0x00000044)
#define ACCESSCTRL_DMA_BITS   _u(0x000000ff)
#define ACCESSCTRL_DMA_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_DBG
// Description : If 1, DMA can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_DMA_DBG_RESET  _u(0x1)
#define ACCESSCTRL_DMA_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_DMA_DBG_MSB    _u(7)
#define ACCESSCTRL_DMA_DBG_LSB    _u(7)
#define ACCESSCTRL_DMA_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_DMA
// Description : If 1, DMA can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_DMA_DMA_RESET  _u(0x1)
#define ACCESSCTRL_DMA_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_DMA_DMA_MSB    _u(6)
#define ACCESSCTRL_DMA_DMA_LSB    _u(6)
#define ACCESSCTRL_DMA_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_CORE1
// Description : If 1, DMA can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_DMA_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_DMA_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_DMA_CORE1_MSB    _u(5)
#define ACCESSCTRL_DMA_CORE1_LSB    _u(5)
#define ACCESSCTRL_DMA_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_CORE0
// Description : If 1, DMA can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_DMA_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_DMA_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_DMA_CORE0_MSB    _u(4)
#define ACCESSCTRL_DMA_CORE0_LSB    _u(4)
#define ACCESSCTRL_DMA_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_SP
// Description : If 1, DMA can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_DMA_SP_RESET  _u(0x1)
#define ACCESSCTRL_DMA_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_DMA_SP_MSB    _u(3)
#define ACCESSCTRL_DMA_SP_LSB    _u(3)
#define ACCESSCTRL_DMA_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_SU
// Description : If 1, and SP is also set, DMA can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_DMA_SU_RESET  _u(0x1)
#define ACCESSCTRL_DMA_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_DMA_SU_MSB    _u(2)
#define ACCESSCTRL_DMA_SU_LSB    _u(2)
#define ACCESSCTRL_DMA_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_NSP
// Description : If 1, DMA can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_DMA_NSP_RESET  _u(0x0)
#define ACCESSCTRL_DMA_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_DMA_NSP_MSB    _u(1)
#define ACCESSCTRL_DMA_NSP_LSB    _u(1)
#define ACCESSCTRL_DMA_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_DMA_NSU
// Description : If 1, and NSP is also set, DMA can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_DMA_NSU_RESET  _u(0x0)
#define ACCESSCTRL_DMA_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_DMA_NSU_MSB    _u(0)
#define ACCESSCTRL_DMA_NSU_LSB    _u(0)
#define ACCESSCTRL_DMA_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_USBCTRL
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               USBCTRL, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_USBCTRL_OFFSET _u(0x00000048)
#define ACCESSCTRL_USBCTRL_BITS   _u(0x000000ff)
#define ACCESSCTRL_USBCTRL_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_DBG
// Description : If 1, USBCTRL can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_USBCTRL_DBG_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_USBCTRL_DBG_MSB    _u(7)
#define ACCESSCTRL_USBCTRL_DBG_LSB    _u(7)
#define ACCESSCTRL_USBCTRL_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_DMA
// Description : If 1, USBCTRL can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_USBCTRL_DMA_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_USBCTRL_DMA_MSB    _u(6)
#define ACCESSCTRL_USBCTRL_DMA_LSB    _u(6)
#define ACCESSCTRL_USBCTRL_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_CORE1
// Description : If 1, USBCTRL can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_USBCTRL_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_USBCTRL_CORE1_MSB    _u(5)
#define ACCESSCTRL_USBCTRL_CORE1_LSB    _u(5)
#define ACCESSCTRL_USBCTRL_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_CORE0
// Description : If 1, USBCTRL can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_USBCTRL_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_USBCTRL_CORE0_MSB    _u(4)
#define ACCESSCTRL_USBCTRL_CORE0_LSB    _u(4)
#define ACCESSCTRL_USBCTRL_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_SP
// Description : If 1, USBCTRL can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_USBCTRL_SP_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_USBCTRL_SP_MSB    _u(3)
#define ACCESSCTRL_USBCTRL_SP_LSB    _u(3)
#define ACCESSCTRL_USBCTRL_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_SU
// Description : If 1, and SP is also set, USBCTRL can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_USBCTRL_SU_RESET  _u(0x1)
#define ACCESSCTRL_USBCTRL_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_USBCTRL_SU_MSB    _u(2)
#define ACCESSCTRL_USBCTRL_SU_LSB    _u(2)
#define ACCESSCTRL_USBCTRL_SU_ACCESS "RW"
