Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_NSP
// Description : If 1, USBCTRL can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_USBCTRL_NSP_RESET  _u(0x0)
#define ACCESSCTRL_USBCTRL_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_USBCTRL_NSP_MSB    _u(1)
#define ACCESSCTRL_USBCTRL_NSP_LSB    _u(1)
#define ACCESSCTRL_USBCTRL_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_USBCTRL_NSU
// Description : If 1, and NSP is also set, USBCTRL can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_USBCTRL_NSU_RESET  _u(0x0)
#define ACCESSCTRL_USBCTRL_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_USBCTRL_NSU_MSB    _u(0)
#define ACCESSCTRL_USBCTRL_NSU_LSB    _u(0)
#define ACCESSCTRL_USBCTRL_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PIO0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PIO0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PIO0_OFFSET _u(0x0000004c)
#define ACCESSCTRL_PIO0_BITS   _u(0x000000ff)
#define ACCESSCTRL_PIO0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_DBG
// Description : If 1, PIO0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PIO0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PIO0_DBG_MSB    _u(7)
#define ACCESSCTRL_PIO0_DBG_LSB    _u(7)
#define ACCESSCTRL_PIO0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_DMA
// Description : If 1, PIO0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PIO0_DMA_MSB    _u(6)
#define ACCESSCTRL_PIO0_DMA_LSB    _u(6)
#define ACCESSCTRL_PIO0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_CORE1
// Description : If 1, PIO0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PIO0_CORE1_MSB    _u(5)
#define ACCESSCTRL_PIO0_CORE1_LSB    _u(5)
#define ACCESSCTRL_PIO0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_CORE0
// Description : If 1, PIO0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PIO0_CORE0_MSB    _u(4)
#define ACCESSCTRL_PIO0_CORE0_LSB    _u(4)
#define ACCESSCTRL_PIO0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_SP
// Description : If 1, PIO0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_PIO0_SP_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PIO0_SP_MSB    _u(3)
#define ACCESSCTRL_PIO0_SP_LSB    _u(3)
#define ACCESSCTRL_PIO0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_SU
// Description : If 1, and SP is also set, PIO0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_PIO0_SU_RESET  _u(0x1)
#define ACCESSCTRL_PIO0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PIO0_SU_MSB    _u(2)
#define ACCESSCTRL_PIO0_SU_LSB    _u(2)
#define ACCESSCTRL_PIO0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_NSP
// Description : If 1, PIO0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PIO0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PIO0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PIO0_NSP_MSB    _u(1)
#define ACCESSCTRL_PIO0_NSP_LSB    _u(1)
#define ACCESSCTRL_PIO0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO0_NSU
// Description : If 1, and NSP is also set, PIO0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PIO0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PIO0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PIO0_NSU_MSB    _u(0)
#define ACCESSCTRL_PIO0_NSU_LSB    _u(0)
#define ACCESSCTRL_PIO0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PIO1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PIO1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PIO1_OFFSET _u(0x00000050)
#define ACCESSCTRL_PIO1_BITS   _u(0x000000ff)
#define ACCESSCTRL_PIO1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_DBG
// Description : If 1, PIO1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PIO1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PIO1_DBG_MSB    _u(7)
#define ACCESSCTRL_PIO1_DBG_LSB    _u(7)
#define ACCESSCTRL_PIO1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_DMA
// Description : If 1, PIO1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PIO1_DMA_MSB    _u(6)
#define ACCESSCTRL_PIO1_DMA_LSB    _u(6)
#define ACCESSCTRL_PIO1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_CORE1
// Description : If 1, PIO1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PIO1_CORE1_MSB    _u(5)
#define ACCESSCTRL_PIO1_CORE1_LSB    _u(5)
#define ACCESSCTRL_PIO1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_CORE0
// Description : If 1, PIO1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PIO1_CORE0_MSB    _u(4)
#define ACCESSCTRL_PIO1_CORE0_LSB    _u(4)
#define ACCESSCTRL_PIO1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_SP
// Description : If 1, PIO1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_PIO1_SP_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PIO1_SP_MSB    _u(3)
#define ACCESSCTRL_PIO1_SP_LSB    _u(3)
#define ACCESSCTRL_PIO1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_SU
// Description : If 1, and SP is also set, PIO1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_PIO1_SU_RESET  _u(0x1)
#define ACCESSCTRL_PIO1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PIO1_SU_MSB    _u(2)
#define ACCESSCTRL_PIO1_SU_LSB    _u(2)
#define ACCESSCTRL_PIO1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_NSP
// Description : If 1, PIO1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PIO1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PIO1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PIO1_NSP_MSB    _u(1)
#define ACCESSCTRL_PIO1_NSP_LSB    _u(1)
#define ACCESSCTRL_PIO1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO1_NSU
// Description : If 1, and NSP is also set, PIO1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PIO1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PIO1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PIO1_NSU_MSB    _u(0)
#define ACCESSCTRL_PIO1_NSU_LSB    _u(0)
#define ACCESSCTRL_PIO1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PIO2
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PIO2, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PIO2_OFFSET _u(0x00000054)
#define ACCESSCTRL_PIO2_BITS   _u(0x000000ff)
#define ACCESSCTRL_PIO2_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_DBG
// Description : If 1, PIO2 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PIO2_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PIO2_DBG_MSB    _u(7)
#define ACCESSCTRL_PIO2_DBG_LSB    _u(7)
#define ACCESSCTRL_PIO2_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_DMA
// Description : If 1, PIO2 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO2_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PIO2_DMA_MSB    _u(6)
#define ACCESSCTRL_PIO2_DMA_LSB    _u(6)
#define ACCESSCTRL_PIO2_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_CORE1
// Description : If 1, PIO2 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO2_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PIO2_CORE1_MSB    _u(5)
#define ACCESSCTRL_PIO2_CORE1_LSB    _u(5)
#define ACCESSCTRL_PIO2_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_CORE0
// Description : If 1, PIO2 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PIO2_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PIO2_CORE0_MSB    _u(4)
#define ACCESSCTRL_PIO2_CORE0_LSB    _u(4)
#define ACCESSCTRL_PIO2_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_SP
// Description : If 1, PIO2 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_PIO2_SP_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PIO2_SP_MSB    _u(3)
#define ACCESSCTRL_PIO2_SP_LSB    _u(3)
#define ACCESSCTRL_PIO2_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_SU
// Description : If 1, and SP is also set, PIO2 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_PIO2_SU_RESET  _u(0x1)
#define ACCESSCTRL_PIO2_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PIO2_SU_MSB    _u(2)
#define ACCESSCTRL_PIO2_SU_LSB    _u(2)
#define ACCESSCTRL_PIO2_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_NSP
// Description : If 1, PIO2 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PIO2_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PIO2_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PIO2_NSP_MSB    _u(1)
#define ACCESSCTRL_PIO2_NSP_LSB    _u(1)
#define ACCESSCTRL_PIO2_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PIO2_NSU
// Description : If 1, and NSP is also set, PIO2 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PIO2_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PIO2_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PIO2_NSU_MSB    _u(0)
#define ACCESSCTRL_PIO2_NSU_LSB    _u(0)
#define ACCESSCTRL_PIO2_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_CORESIGHT_TRACE
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               CORESIGHT_TRACE, and at what security/privilege levels they can
//               do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_CORESIGHT_TRACE_OFFSET _u(0x00000058)
#define ACCESSCTRL_CORESIGHT_TRACE_BITS   _u(0x000000ff)
#define ACCESSCTRL_CORESIGHT_TRACE_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_DBG
// Description : If 1, CORESIGHT_TRACE can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_MSB    _u(7)
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_LSB    _u(7)
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_DMA
// Description : If 1, CORESIGHT_TRACE can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_MSB    _u(6)
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_LSB    _u(6)
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_CORE1
// Description : If 1, CORESIGHT_TRACE can be accessed by core 1, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_MSB    _u(5)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_LSB    _u(5)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_CORE0
// Description : If 1, CORESIGHT_TRACE can be accessed by core 0, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_MSB    _u(4)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_LSB    _u(4)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_SP
// Description : If 1, CORESIGHT_TRACE can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_CORESIGHT_TRACE_SP_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_TRACE_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_CORESIGHT_TRACE_SP_MSB    _u(3)
#define ACCESSCTRL_CORESIGHT_TRACE_SP_LSB    _u(3)
#define ACCESSCTRL_CORESIGHT_TRACE_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_SU
// Description : If 1, and SP is also set, CORESIGHT_TRACE can be accessed from
//               a Secure, Unprivileged context.
#define ACCESSCTRL_CORESIGHT_TRACE_SU_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_TRACE_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_CORESIGHT_TRACE_SU_MSB    _u(2)
#define ACCESSCTRL_CORESIGHT_TRACE_SU_LSB    _u(2)
#define ACCESSCTRL_CORESIGHT_TRACE_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_NSP
// Description : If 1, CORESIGHT_TRACE can be accessed from a Non-secure,
//               Privileged context.
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_MSB    _u(1)
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_LSB    _u(1)
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_TRACE_NSU
// Description : If 1, and NSP is also set, CORESIGHT_TRACE can be accessed from
//               a Non-secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_MSB    _u(0)
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_LSB    _u(0)
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_CORESIGHT_PERIPH
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               CORESIGHT_PERIPH, and at what security/privilege levels they
//               can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_CORESIGHT_PERIPH_OFFSET _u(0x0000005c)
#define ACCESSCTRL_CORESIGHT_PERIPH_BITS   _u(0x000000ff)
#define ACCESSCTRL_CORESIGHT_PERIPH_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_DBG
// Description : If 1, CORESIGHT_PERIPH can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_MSB    _u(7)
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_LSB    _u(7)
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_DMA
// Description : If 1, CORESIGHT_PERIPH can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_MSB    _u(6)
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_LSB    _u(6)
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_CORE1
// Description : If 1, CORESIGHT_PERIPH can be accessed by core 1, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_MSB    _u(5)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_LSB    _u(5)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_CORE0
// Description : If 1, CORESIGHT_PERIPH can be accessed by core 0, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_MSB    _u(4)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_LSB    _u(4)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_SP
// Description : If 1, CORESIGHT_PERIPH can be accessed from a Secure,
//               Privileged context.
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_RESET  _u(0x1)
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_MSB    _u(3)
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_LSB    _u(3)
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_SU
// Description : If 1, and SP is also set, CORESIGHT_PERIPH can be accessed from
//               a Secure, Unprivileged context.
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_RESET  _u(0x0)
