Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_MSB    _u(2)
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_LSB    _u(2)
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_NSP
// Description : If 1, CORESIGHT_PERIPH can be accessed from a Non-secure,
//               Privileged context.
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_MSB    _u(1)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_LSB    _u(1)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CORESIGHT_PERIPH_NSU
// Description : If 1, and NSP is also set, CORESIGHT_PERIPH can be accessed
//               from a Non-secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_RESET  _u(0x0)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_MSB    _u(0)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_LSB    _u(0)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SYSINFO
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SYSINFO, and at what security/privilege levels they can do so.
//
//               Defaults to fully open access.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SYSINFO_OFFSET _u(0x00000060)
#define ACCESSCTRL_SYSINFO_BITS   _u(0x000000ff)
#define ACCESSCTRL_SYSINFO_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_DBG
// Description : If 1, SYSINFO can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SYSINFO_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SYSINFO_DBG_MSB    _u(7)
#define ACCESSCTRL_SYSINFO_DBG_LSB    _u(7)
#define ACCESSCTRL_SYSINFO_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_DMA
// Description : If 1, SYSINFO can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSINFO_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SYSINFO_DMA_MSB    _u(6)
#define ACCESSCTRL_SYSINFO_DMA_LSB    _u(6)
#define ACCESSCTRL_SYSINFO_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_CORE1
// Description : If 1, SYSINFO can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSINFO_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SYSINFO_CORE1_MSB    _u(5)
#define ACCESSCTRL_SYSINFO_CORE1_LSB    _u(5)
#define ACCESSCTRL_SYSINFO_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_CORE0
// Description : If 1, SYSINFO can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSINFO_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SYSINFO_CORE0_MSB    _u(4)
#define ACCESSCTRL_SYSINFO_CORE0_LSB    _u(4)
#define ACCESSCTRL_SYSINFO_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_SP
// Description : If 1, SYSINFO can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_SYSINFO_SP_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SYSINFO_SP_MSB    _u(3)
#define ACCESSCTRL_SYSINFO_SP_LSB    _u(3)
#define ACCESSCTRL_SYSINFO_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_SU
// Description : If 1, and SP is also set, SYSINFO can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_SYSINFO_SU_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SYSINFO_SU_MSB    _u(2)
#define ACCESSCTRL_SYSINFO_SU_LSB    _u(2)
#define ACCESSCTRL_SYSINFO_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_NSP
// Description : If 1, SYSINFO can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SYSINFO_NSP_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SYSINFO_NSP_MSB    _u(1)
#define ACCESSCTRL_SYSINFO_NSP_LSB    _u(1)
#define ACCESSCTRL_SYSINFO_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSINFO_NSU
// Description : If 1, and NSP is also set, SYSINFO can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SYSINFO_NSU_RESET  _u(0x1)
#define ACCESSCTRL_SYSINFO_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SYSINFO_NSU_MSB    _u(0)
#define ACCESSCTRL_SYSINFO_NSU_LSB    _u(0)
#define ACCESSCTRL_SYSINFO_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_RESETS
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               RESETS, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_RESETS_OFFSET _u(0x00000064)
#define ACCESSCTRL_RESETS_BITS   _u(0x000000ff)
#define ACCESSCTRL_RESETS_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_DBG
// Description : If 1, RESETS can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_RESETS_DBG_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_RESETS_DBG_MSB    _u(7)
#define ACCESSCTRL_RESETS_DBG_LSB    _u(7)
#define ACCESSCTRL_RESETS_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_DMA
// Description : If 1, RESETS can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RESETS_DMA_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_RESETS_DMA_MSB    _u(6)
#define ACCESSCTRL_RESETS_DMA_LSB    _u(6)
#define ACCESSCTRL_RESETS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_CORE1
// Description : If 1, RESETS can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RESETS_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_RESETS_CORE1_MSB    _u(5)
#define ACCESSCTRL_RESETS_CORE1_LSB    _u(5)
#define ACCESSCTRL_RESETS_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_CORE0
// Description : If 1, RESETS can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RESETS_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_RESETS_CORE0_MSB    _u(4)
#define ACCESSCTRL_RESETS_CORE0_LSB    _u(4)
#define ACCESSCTRL_RESETS_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_SP
// Description : If 1, RESETS can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_RESETS_SP_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_RESETS_SP_MSB    _u(3)
#define ACCESSCTRL_RESETS_SP_LSB    _u(3)
#define ACCESSCTRL_RESETS_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_SU
// Description : If 1, and SP is also set, RESETS can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_RESETS_SU_RESET  _u(0x1)
#define ACCESSCTRL_RESETS_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_RESETS_SU_MSB    _u(2)
#define ACCESSCTRL_RESETS_SU_LSB    _u(2)
#define ACCESSCTRL_RESETS_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_NSP
// Description : If 1, RESETS can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_RESETS_NSP_RESET  _u(0x0)
#define ACCESSCTRL_RESETS_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_RESETS_NSP_MSB    _u(1)
#define ACCESSCTRL_RESETS_NSP_LSB    _u(1)
#define ACCESSCTRL_RESETS_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RESETS_NSU
// Description : If 1, and NSP is also set, RESETS can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_RESETS_NSU_RESET  _u(0x0)
#define ACCESSCTRL_RESETS_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_RESETS_NSU_MSB    _u(0)
#define ACCESSCTRL_RESETS_NSU_LSB    _u(0)
#define ACCESSCTRL_RESETS_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_IO_BANK0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               IO_BANK0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_IO_BANK0_OFFSET _u(0x00000068)
#define ACCESSCTRL_IO_BANK0_BITS   _u(0x000000ff)
#define ACCESSCTRL_IO_BANK0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_DBG
// Description : If 1, IO_BANK0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_IO_BANK0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_IO_BANK0_DBG_MSB    _u(7)
#define ACCESSCTRL_IO_BANK0_DBG_LSB    _u(7)
#define ACCESSCTRL_IO_BANK0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_DMA
// Description : If 1, IO_BANK0 can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_IO_BANK0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_IO_BANK0_DMA_MSB    _u(6)
#define ACCESSCTRL_IO_BANK0_DMA_LSB    _u(6)
#define ACCESSCTRL_IO_BANK0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_CORE1
// Description : If 1, IO_BANK0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_IO_BANK0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_IO_BANK0_CORE1_MSB    _u(5)
#define ACCESSCTRL_IO_BANK0_CORE1_LSB    _u(5)
#define ACCESSCTRL_IO_BANK0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_CORE0
// Description : If 1, IO_BANK0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_IO_BANK0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_IO_BANK0_CORE0_MSB    _u(4)
#define ACCESSCTRL_IO_BANK0_CORE0_LSB    _u(4)
#define ACCESSCTRL_IO_BANK0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_SP
// Description : If 1, IO_BANK0 can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_IO_BANK0_SP_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_IO_BANK0_SP_MSB    _u(3)
#define ACCESSCTRL_IO_BANK0_SP_LSB    _u(3)
#define ACCESSCTRL_IO_BANK0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_SU
// Description : If 1, and SP is also set, IO_BANK0 can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_IO_BANK0_SU_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_IO_BANK0_SU_MSB    _u(2)
#define ACCESSCTRL_IO_BANK0_SU_LSB    _u(2)
#define ACCESSCTRL_IO_BANK0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_NSP
// Description : If 1, IO_BANK0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_IO_BANK0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_IO_BANK0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_IO_BANK0_NSP_MSB    _u(1)
#define ACCESSCTRL_IO_BANK0_NSP_LSB    _u(1)
#define ACCESSCTRL_IO_BANK0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK0_NSU
// Description : If 1, and NSP is also set, IO_BANK0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_IO_BANK0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_IO_BANK0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_IO_BANK0_NSU_MSB    _u(0)
#define ACCESSCTRL_IO_BANK0_NSU_LSB    _u(0)
#define ACCESSCTRL_IO_BANK0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_IO_BANK1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               IO_BANK1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_IO_BANK1_OFFSET _u(0x0000006c)
#define ACCESSCTRL_IO_BANK1_BITS   _u(0x000000ff)
#define ACCESSCTRL_IO_BANK1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_DBG
// Description : If 1, IO_BANK1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_IO_BANK1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_IO_BANK1_DBG_MSB    _u(7)
#define ACCESSCTRL_IO_BANK1_DBG_LSB    _u(7)
#define ACCESSCTRL_IO_BANK1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_DMA
// Description : If 1, IO_BANK1 can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_IO_BANK1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_IO_BANK1_DMA_MSB    _u(6)
#define ACCESSCTRL_IO_BANK1_DMA_LSB    _u(6)
#define ACCESSCTRL_IO_BANK1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_CORE1
// Description : If 1, IO_BANK1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_IO_BANK1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_IO_BANK1_CORE1_MSB    _u(5)
#define ACCESSCTRL_IO_BANK1_CORE1_LSB    _u(5)
#define ACCESSCTRL_IO_BANK1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_CORE0
// Description : If 1, IO_BANK1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_IO_BANK1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_IO_BANK1_CORE0_MSB    _u(4)
#define ACCESSCTRL_IO_BANK1_CORE0_LSB    _u(4)
#define ACCESSCTRL_IO_BANK1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_SP
// Description : If 1, IO_BANK1 can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_IO_BANK1_SP_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_IO_BANK1_SP_MSB    _u(3)
#define ACCESSCTRL_IO_BANK1_SP_LSB    _u(3)
#define ACCESSCTRL_IO_BANK1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_SU
// Description : If 1, and SP is also set, IO_BANK1 can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_IO_BANK1_SU_RESET  _u(0x1)
#define ACCESSCTRL_IO_BANK1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_IO_BANK1_SU_MSB    _u(2)
#define ACCESSCTRL_IO_BANK1_SU_LSB    _u(2)
#define ACCESSCTRL_IO_BANK1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_NSP
// Description : If 1, IO_BANK1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_IO_BANK1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_IO_BANK1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_IO_BANK1_NSP_MSB    _u(1)
#define ACCESSCTRL_IO_BANK1_NSP_LSB    _u(1)
#define ACCESSCTRL_IO_BANK1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_IO_BANK1_NSU
// Description : If 1, and NSP is also set, IO_BANK1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_IO_BANK1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_IO_BANK1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_IO_BANK1_NSU_MSB    _u(0)
#define ACCESSCTRL_IO_BANK1_NSU_LSB    _u(0)
#define ACCESSCTRL_IO_BANK1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PADS_BANK0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PADS_BANK0, and at what security/privilege levels they can do
//               so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PADS_BANK0_OFFSET _u(0x00000070)
#define ACCESSCTRL_PADS_BANK0_BITS   _u(0x000000ff)
#define ACCESSCTRL_PADS_BANK0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_DBG
// Description : If 1, PADS_BANK0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_BANK0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PADS_BANK0_DBG_MSB    _u(7)
#define ACCESSCTRL_PADS_BANK0_DBG_LSB    _u(7)
#define ACCESSCTRL_PADS_BANK0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_DMA
// Description : If 1, PADS_BANK0 can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_BANK0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PADS_BANK0_DMA_MSB    _u(6)
#define ACCESSCTRL_PADS_BANK0_DMA_LSB    _u(6)
#define ACCESSCTRL_PADS_BANK0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_CORE1
// Description : If 1, PADS_BANK0 can be accessed by core 1, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_BANK0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PADS_BANK0_CORE1_MSB    _u(5)
#define ACCESSCTRL_PADS_BANK0_CORE1_LSB    _u(5)
#define ACCESSCTRL_PADS_BANK0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_CORE0
// Description : If 1, PADS_BANK0 can be accessed by core 0, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_BANK0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PADS_BANK0_CORE0_MSB    _u(4)
#define ACCESSCTRL_PADS_BANK0_CORE0_LSB    _u(4)
#define ACCESSCTRL_PADS_BANK0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_SP
// Description : If 1, PADS_BANK0 can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_PADS_BANK0_SP_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PADS_BANK0_SP_MSB    _u(3)
#define ACCESSCTRL_PADS_BANK0_SP_LSB    _u(3)
#define ACCESSCTRL_PADS_BANK0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_SU
