Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
// Description : If 1, and SP is also set, PADS_BANK0 can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_PADS_BANK0_SU_RESET  _u(0x1)
#define ACCESSCTRL_PADS_BANK0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PADS_BANK0_SU_MSB    _u(2)
#define ACCESSCTRL_PADS_BANK0_SU_LSB    _u(2)
#define ACCESSCTRL_PADS_BANK0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_NSP
// Description : If 1, PADS_BANK0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PADS_BANK0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PADS_BANK0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PADS_BANK0_NSP_MSB    _u(1)
#define ACCESSCTRL_PADS_BANK0_NSP_LSB    _u(1)
#define ACCESSCTRL_PADS_BANK0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_BANK0_NSU
// Description : If 1, and NSP is also set, PADS_BANK0 can be accessed from a
//               Non-secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PADS_BANK0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PADS_BANK0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PADS_BANK0_NSU_MSB    _u(0)
#define ACCESSCTRL_PADS_BANK0_NSU_LSB    _u(0)
#define ACCESSCTRL_PADS_BANK0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PADS_QSPI
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PADS_QSPI, and at what security/privilege levels they can do
//               so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PADS_QSPI_OFFSET _u(0x00000074)
#define ACCESSCTRL_PADS_QSPI_BITS   _u(0x000000ff)
#define ACCESSCTRL_PADS_QSPI_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_DBG
// Description : If 1, PADS_QSPI can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_QSPI_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PADS_QSPI_DBG_MSB    _u(7)
#define ACCESSCTRL_PADS_QSPI_DBG_LSB    _u(7)
#define ACCESSCTRL_PADS_QSPI_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_DMA
// Description : If 1, PADS_QSPI can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_QSPI_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PADS_QSPI_DMA_MSB    _u(6)
#define ACCESSCTRL_PADS_QSPI_DMA_LSB    _u(6)
#define ACCESSCTRL_PADS_QSPI_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_CORE1
// Description : If 1, PADS_QSPI can be accessed by core 1, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_QSPI_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PADS_QSPI_CORE1_MSB    _u(5)
#define ACCESSCTRL_PADS_QSPI_CORE1_LSB    _u(5)
#define ACCESSCTRL_PADS_QSPI_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_CORE0
// Description : If 1, PADS_QSPI can be accessed by core 0, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PADS_QSPI_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PADS_QSPI_CORE0_MSB    _u(4)
#define ACCESSCTRL_PADS_QSPI_CORE0_LSB    _u(4)
#define ACCESSCTRL_PADS_QSPI_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_SP
// Description : If 1, PADS_QSPI can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_PADS_QSPI_SP_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PADS_QSPI_SP_MSB    _u(3)
#define ACCESSCTRL_PADS_QSPI_SP_LSB    _u(3)
#define ACCESSCTRL_PADS_QSPI_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_SU
// Description : If 1, and SP is also set, PADS_QSPI can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_PADS_QSPI_SU_RESET  _u(0x1)
#define ACCESSCTRL_PADS_QSPI_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PADS_QSPI_SU_MSB    _u(2)
#define ACCESSCTRL_PADS_QSPI_SU_LSB    _u(2)
#define ACCESSCTRL_PADS_QSPI_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_NSP
// Description : If 1, PADS_QSPI can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PADS_QSPI_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PADS_QSPI_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PADS_QSPI_NSP_MSB    _u(1)
#define ACCESSCTRL_PADS_QSPI_NSP_LSB    _u(1)
#define ACCESSCTRL_PADS_QSPI_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PADS_QSPI_NSU
// Description : If 1, and NSP is also set, PADS_QSPI can be accessed from a
//               Non-secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PADS_QSPI_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PADS_QSPI_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PADS_QSPI_NSU_MSB    _u(0)
#define ACCESSCTRL_PADS_QSPI_NSU_LSB    _u(0)
#define ACCESSCTRL_PADS_QSPI_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_BUSCTRL
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               BUSCTRL, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_BUSCTRL_OFFSET _u(0x00000078)
#define ACCESSCTRL_BUSCTRL_BITS   _u(0x000000ff)
#define ACCESSCTRL_BUSCTRL_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_DBG
// Description : If 1, BUSCTRL can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_BUSCTRL_DBG_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_BUSCTRL_DBG_MSB    _u(7)
#define ACCESSCTRL_BUSCTRL_DBG_LSB    _u(7)
#define ACCESSCTRL_BUSCTRL_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_DMA
// Description : If 1, BUSCTRL can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_BUSCTRL_DMA_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_BUSCTRL_DMA_MSB    _u(6)
#define ACCESSCTRL_BUSCTRL_DMA_LSB    _u(6)
#define ACCESSCTRL_BUSCTRL_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_CORE1
// Description : If 1, BUSCTRL can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_BUSCTRL_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_BUSCTRL_CORE1_MSB    _u(5)
#define ACCESSCTRL_BUSCTRL_CORE1_LSB    _u(5)
#define ACCESSCTRL_BUSCTRL_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_CORE0
// Description : If 1, BUSCTRL can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_BUSCTRL_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_BUSCTRL_CORE0_MSB    _u(4)
#define ACCESSCTRL_BUSCTRL_CORE0_LSB    _u(4)
#define ACCESSCTRL_BUSCTRL_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_SP
// Description : If 1, BUSCTRL can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_BUSCTRL_SP_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_BUSCTRL_SP_MSB    _u(3)
#define ACCESSCTRL_BUSCTRL_SP_LSB    _u(3)
#define ACCESSCTRL_BUSCTRL_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_SU
// Description : If 1, and SP is also set, BUSCTRL can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_BUSCTRL_SU_RESET  _u(0x1)
#define ACCESSCTRL_BUSCTRL_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_BUSCTRL_SU_MSB    _u(2)
#define ACCESSCTRL_BUSCTRL_SU_LSB    _u(2)
#define ACCESSCTRL_BUSCTRL_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_NSP
// Description : If 1, BUSCTRL can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_BUSCTRL_NSP_RESET  _u(0x0)
#define ACCESSCTRL_BUSCTRL_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_BUSCTRL_NSP_MSB    _u(1)
#define ACCESSCTRL_BUSCTRL_NSP_LSB    _u(1)
#define ACCESSCTRL_BUSCTRL_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_BUSCTRL_NSU
// Description : If 1, and NSP is also set, BUSCTRL can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_BUSCTRL_NSU_RESET  _u(0x0)
#define ACCESSCTRL_BUSCTRL_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_BUSCTRL_NSU_MSB    _u(0)
#define ACCESSCTRL_BUSCTRL_NSU_LSB    _u(0)
#define ACCESSCTRL_BUSCTRL_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_ADC0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               ADC0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_ADC0_OFFSET _u(0x0000007c)
#define ACCESSCTRL_ADC0_BITS   _u(0x000000ff)
#define ACCESSCTRL_ADC0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_DBG
// Description : If 1, ADC0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_ADC0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_ADC0_DBG_MSB    _u(7)
#define ACCESSCTRL_ADC0_DBG_LSB    _u(7)
#define ACCESSCTRL_ADC0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_DMA
// Description : If 1, ADC0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ADC0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_ADC0_DMA_MSB    _u(6)
#define ACCESSCTRL_ADC0_DMA_LSB    _u(6)
#define ACCESSCTRL_ADC0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_CORE1
// Description : If 1, ADC0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ADC0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_ADC0_CORE1_MSB    _u(5)
#define ACCESSCTRL_ADC0_CORE1_LSB    _u(5)
#define ACCESSCTRL_ADC0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_CORE0
// Description : If 1, ADC0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ADC0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_ADC0_CORE0_MSB    _u(4)
#define ACCESSCTRL_ADC0_CORE0_LSB    _u(4)
#define ACCESSCTRL_ADC0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_SP
// Description : If 1, ADC0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_ADC0_SP_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_ADC0_SP_MSB    _u(3)
#define ACCESSCTRL_ADC0_SP_LSB    _u(3)
#define ACCESSCTRL_ADC0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_SU
// Description : If 1, and SP is also set, ADC0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_ADC0_SU_RESET  _u(0x1)
#define ACCESSCTRL_ADC0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_ADC0_SU_MSB    _u(2)
#define ACCESSCTRL_ADC0_SU_LSB    _u(2)
#define ACCESSCTRL_ADC0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_NSP
// Description : If 1, ADC0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_ADC0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_ADC0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_ADC0_NSP_MSB    _u(1)
#define ACCESSCTRL_ADC0_NSP_LSB    _u(1)
#define ACCESSCTRL_ADC0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ADC0_NSU
// Description : If 1, and NSP is also set, ADC0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_ADC0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_ADC0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_ADC0_NSU_MSB    _u(0)
#define ACCESSCTRL_ADC0_NSU_LSB    _u(0)
#define ACCESSCTRL_ADC0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_HSTX
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               HSTX, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_HSTX_OFFSET _u(0x00000080)
#define ACCESSCTRL_HSTX_BITS   _u(0x000000ff)
#define ACCESSCTRL_HSTX_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_DBG
// Description : If 1, HSTX can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_HSTX_DBG_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_HSTX_DBG_MSB    _u(7)
#define ACCESSCTRL_HSTX_DBG_LSB    _u(7)
#define ACCESSCTRL_HSTX_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_DMA
// Description : If 1, HSTX can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_HSTX_DMA_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_HSTX_DMA_MSB    _u(6)
#define ACCESSCTRL_HSTX_DMA_LSB    _u(6)
#define ACCESSCTRL_HSTX_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_CORE1
// Description : If 1, HSTX can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_HSTX_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_HSTX_CORE1_MSB    _u(5)
#define ACCESSCTRL_HSTX_CORE1_LSB    _u(5)
#define ACCESSCTRL_HSTX_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_CORE0
// Description : If 1, HSTX can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_HSTX_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_HSTX_CORE0_MSB    _u(4)
#define ACCESSCTRL_HSTX_CORE0_LSB    _u(4)
#define ACCESSCTRL_HSTX_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_SP
// Description : If 1, HSTX can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_HSTX_SP_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_HSTX_SP_MSB    _u(3)
#define ACCESSCTRL_HSTX_SP_LSB    _u(3)
#define ACCESSCTRL_HSTX_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_SU
// Description : If 1, and SP is also set, HSTX can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_HSTX_SU_RESET  _u(0x1)
#define ACCESSCTRL_HSTX_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_HSTX_SU_MSB    _u(2)
#define ACCESSCTRL_HSTX_SU_LSB    _u(2)
#define ACCESSCTRL_HSTX_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_NSP
// Description : If 1, HSTX can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_HSTX_NSP_RESET  _u(0x0)
#define ACCESSCTRL_HSTX_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_HSTX_NSP_MSB    _u(1)
#define ACCESSCTRL_HSTX_NSP_LSB    _u(1)
#define ACCESSCTRL_HSTX_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_HSTX_NSU
// Description : If 1, and NSP is also set, HSTX can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_HSTX_NSU_RESET  _u(0x0)
#define ACCESSCTRL_HSTX_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_HSTX_NSU_MSB    _u(0)
#define ACCESSCTRL_HSTX_NSU_LSB    _u(0)
#define ACCESSCTRL_HSTX_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_I2C0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               I2C0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_I2C0_OFFSET _u(0x00000084)
#define ACCESSCTRL_I2C0_BITS   _u(0x000000ff)
#define ACCESSCTRL_I2C0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_DBG
// Description : If 1, I2C0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_I2C0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_I2C0_DBG_MSB    _u(7)
#define ACCESSCTRL_I2C0_DBG_LSB    _u(7)
#define ACCESSCTRL_I2C0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_DMA
// Description : If 1, I2C0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_I2C0_DMA_MSB    _u(6)
#define ACCESSCTRL_I2C0_DMA_LSB    _u(6)
#define ACCESSCTRL_I2C0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_CORE1
// Description : If 1, I2C0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_I2C0_CORE1_MSB    _u(5)
#define ACCESSCTRL_I2C0_CORE1_LSB    _u(5)
#define ACCESSCTRL_I2C0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_CORE0
// Description : If 1, I2C0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_I2C0_CORE0_MSB    _u(4)
#define ACCESSCTRL_I2C0_CORE0_LSB    _u(4)
#define ACCESSCTRL_I2C0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_SP
// Description : If 1, I2C0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_I2C0_SP_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_I2C0_SP_MSB    _u(3)
#define ACCESSCTRL_I2C0_SP_LSB    _u(3)
#define ACCESSCTRL_I2C0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_SU
// Description : If 1, and SP is also set, I2C0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_I2C0_SU_RESET  _u(0x1)
#define ACCESSCTRL_I2C0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_I2C0_SU_MSB    _u(2)
#define ACCESSCTRL_I2C0_SU_LSB    _u(2)
#define ACCESSCTRL_I2C0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_NSP
// Description : If 1, I2C0 can be accessed from a Non-secure, Privileged
//               context.
