Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_I2C0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_I2C0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_I2C0_NSP_MSB    _u(1)
#define ACCESSCTRL_I2C0_NSP_LSB    _u(1)
#define ACCESSCTRL_I2C0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C0_NSU
// Description : If 1, and NSP is also set, I2C0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_I2C0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_I2C0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_I2C0_NSU_MSB    _u(0)
#define ACCESSCTRL_I2C0_NSU_LSB    _u(0)
#define ACCESSCTRL_I2C0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_I2C1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               I2C1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_I2C1_OFFSET _u(0x00000088)
#define ACCESSCTRL_I2C1_BITS   _u(0x000000ff)
#define ACCESSCTRL_I2C1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_DBG
// Description : If 1, I2C1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_I2C1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_I2C1_DBG_MSB    _u(7)
#define ACCESSCTRL_I2C1_DBG_LSB    _u(7)
#define ACCESSCTRL_I2C1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_DMA
// Description : If 1, I2C1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_I2C1_DMA_MSB    _u(6)
#define ACCESSCTRL_I2C1_DMA_LSB    _u(6)
#define ACCESSCTRL_I2C1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_CORE1
// Description : If 1, I2C1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_I2C1_CORE1_MSB    _u(5)
#define ACCESSCTRL_I2C1_CORE1_LSB    _u(5)
#define ACCESSCTRL_I2C1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_CORE0
// Description : If 1, I2C1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_I2C1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_I2C1_CORE0_MSB    _u(4)
#define ACCESSCTRL_I2C1_CORE0_LSB    _u(4)
#define ACCESSCTRL_I2C1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_SP
// Description : If 1, I2C1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_I2C1_SP_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_I2C1_SP_MSB    _u(3)
#define ACCESSCTRL_I2C1_SP_LSB    _u(3)
#define ACCESSCTRL_I2C1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_SU
// Description : If 1, and SP is also set, I2C1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_I2C1_SU_RESET  _u(0x1)
#define ACCESSCTRL_I2C1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_I2C1_SU_MSB    _u(2)
#define ACCESSCTRL_I2C1_SU_LSB    _u(2)
#define ACCESSCTRL_I2C1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_NSP
// Description : If 1, I2C1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_I2C1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_I2C1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_I2C1_NSP_MSB    _u(1)
#define ACCESSCTRL_I2C1_NSP_LSB    _u(1)
#define ACCESSCTRL_I2C1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_I2C1_NSU
// Description : If 1, and NSP is also set, I2C1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_I2C1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_I2C1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_I2C1_NSU_MSB    _u(0)
#define ACCESSCTRL_I2C1_NSU_LSB    _u(0)
#define ACCESSCTRL_I2C1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PWM
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PWM, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PWM_OFFSET _u(0x0000008c)
#define ACCESSCTRL_PWM_BITS   _u(0x000000ff)
#define ACCESSCTRL_PWM_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_DBG
// Description : If 1, PWM can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PWM_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PWM_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PWM_DBG_MSB    _u(7)
#define ACCESSCTRL_PWM_DBG_LSB    _u(7)
#define ACCESSCTRL_PWM_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_DMA
// Description : If 1, PWM can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PWM_DMA_RESET  _u(0x1)
#define ACCESSCTRL_PWM_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PWM_DMA_MSB    _u(6)
#define ACCESSCTRL_PWM_DMA_LSB    _u(6)
#define ACCESSCTRL_PWM_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_CORE1
// Description : If 1, PWM can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PWM_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PWM_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PWM_CORE1_MSB    _u(5)
#define ACCESSCTRL_PWM_CORE1_LSB    _u(5)
#define ACCESSCTRL_PWM_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_CORE0
// Description : If 1, PWM can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PWM_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PWM_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PWM_CORE0_MSB    _u(4)
#define ACCESSCTRL_PWM_CORE0_LSB    _u(4)
#define ACCESSCTRL_PWM_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_SP
// Description : If 1, PWM can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_PWM_SP_RESET  _u(0x1)
#define ACCESSCTRL_PWM_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PWM_SP_MSB    _u(3)
#define ACCESSCTRL_PWM_SP_LSB    _u(3)
#define ACCESSCTRL_PWM_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_SU
// Description : If 1, and SP is also set, PWM can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_PWM_SU_RESET  _u(0x1)
#define ACCESSCTRL_PWM_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PWM_SU_MSB    _u(2)
#define ACCESSCTRL_PWM_SU_LSB    _u(2)
#define ACCESSCTRL_PWM_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_NSP
// Description : If 1, PWM can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PWM_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PWM_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PWM_NSP_MSB    _u(1)
#define ACCESSCTRL_PWM_NSP_LSB    _u(1)
#define ACCESSCTRL_PWM_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PWM_NSU
// Description : If 1, and NSP is also set, PWM can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PWM_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PWM_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PWM_NSU_MSB    _u(0)
#define ACCESSCTRL_PWM_NSU_LSB    _u(0)
#define ACCESSCTRL_PWM_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SPI0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SPI0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SPI0_OFFSET _u(0x00000090)
#define ACCESSCTRL_SPI0_BITS   _u(0x000000ff)
#define ACCESSCTRL_SPI0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_DBG
// Description : If 1, SPI0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SPI0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SPI0_DBG_MSB    _u(7)
#define ACCESSCTRL_SPI0_DBG_LSB    _u(7)
#define ACCESSCTRL_SPI0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_DMA
// Description : If 1, SPI0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SPI0_DMA_MSB    _u(6)
#define ACCESSCTRL_SPI0_DMA_LSB    _u(6)
#define ACCESSCTRL_SPI0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_CORE1
// Description : If 1, SPI0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SPI0_CORE1_MSB    _u(5)
#define ACCESSCTRL_SPI0_CORE1_LSB    _u(5)
#define ACCESSCTRL_SPI0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_CORE0
// Description : If 1, SPI0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SPI0_CORE0_MSB    _u(4)
#define ACCESSCTRL_SPI0_CORE0_LSB    _u(4)
#define ACCESSCTRL_SPI0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_SP
// Description : If 1, SPI0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SPI0_SP_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SPI0_SP_MSB    _u(3)
#define ACCESSCTRL_SPI0_SP_LSB    _u(3)
#define ACCESSCTRL_SPI0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_SU
// Description : If 1, and SP is also set, SPI0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SPI0_SU_RESET  _u(0x1)
#define ACCESSCTRL_SPI0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SPI0_SU_MSB    _u(2)
#define ACCESSCTRL_SPI0_SU_LSB    _u(2)
#define ACCESSCTRL_SPI0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_NSP
// Description : If 1, SPI0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SPI0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_SPI0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SPI0_NSP_MSB    _u(1)
#define ACCESSCTRL_SPI0_NSP_LSB    _u(1)
#define ACCESSCTRL_SPI0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI0_NSU
// Description : If 1, and NSP is also set, SPI0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SPI0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_SPI0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SPI0_NSU_MSB    _u(0)
#define ACCESSCTRL_SPI0_NSU_LSB    _u(0)
#define ACCESSCTRL_SPI0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SPI1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SPI1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SPI1_OFFSET _u(0x00000094)
#define ACCESSCTRL_SPI1_BITS   _u(0x000000ff)
#define ACCESSCTRL_SPI1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_DBG
// Description : If 1, SPI1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SPI1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SPI1_DBG_MSB    _u(7)
#define ACCESSCTRL_SPI1_DBG_LSB    _u(7)
#define ACCESSCTRL_SPI1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_DMA
// Description : If 1, SPI1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SPI1_DMA_MSB    _u(6)
#define ACCESSCTRL_SPI1_DMA_LSB    _u(6)
#define ACCESSCTRL_SPI1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_CORE1
// Description : If 1, SPI1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SPI1_CORE1_MSB    _u(5)
#define ACCESSCTRL_SPI1_CORE1_LSB    _u(5)
#define ACCESSCTRL_SPI1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_CORE0
// Description : If 1, SPI1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SPI1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SPI1_CORE0_MSB    _u(4)
#define ACCESSCTRL_SPI1_CORE0_LSB    _u(4)
#define ACCESSCTRL_SPI1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_SP
// Description : If 1, SPI1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SPI1_SP_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SPI1_SP_MSB    _u(3)
#define ACCESSCTRL_SPI1_SP_LSB    _u(3)
#define ACCESSCTRL_SPI1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_SU
// Description : If 1, and SP is also set, SPI1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SPI1_SU_RESET  _u(0x1)
#define ACCESSCTRL_SPI1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SPI1_SU_MSB    _u(2)
#define ACCESSCTRL_SPI1_SU_LSB    _u(2)
#define ACCESSCTRL_SPI1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_NSP
// Description : If 1, SPI1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SPI1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_SPI1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SPI1_NSP_MSB    _u(1)
#define ACCESSCTRL_SPI1_NSP_LSB    _u(1)
#define ACCESSCTRL_SPI1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SPI1_NSU
// Description : If 1, and NSP is also set, SPI1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SPI1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_SPI1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SPI1_NSU_MSB    _u(0)
#define ACCESSCTRL_SPI1_NSU_LSB    _u(0)
#define ACCESSCTRL_SPI1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_TIMER0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               TIMER0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_TIMER0_OFFSET _u(0x00000098)
#define ACCESSCTRL_TIMER0_BITS   _u(0x000000ff)
#define ACCESSCTRL_TIMER0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_DBG
// Description : If 1, TIMER0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_TIMER0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_TIMER0_DBG_MSB    _u(7)
#define ACCESSCTRL_TIMER0_DBG_LSB    _u(7)
#define ACCESSCTRL_TIMER0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_DMA
// Description : If 1, TIMER0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_TIMER0_DMA_MSB    _u(6)
#define ACCESSCTRL_TIMER0_DMA_LSB    _u(6)
#define ACCESSCTRL_TIMER0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_CORE1
// Description : If 1, TIMER0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_TIMER0_CORE1_MSB    _u(5)
#define ACCESSCTRL_TIMER0_CORE1_LSB    _u(5)
#define ACCESSCTRL_TIMER0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_CORE0
// Description : If 1, TIMER0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_TIMER0_CORE0_MSB    _u(4)
#define ACCESSCTRL_TIMER0_CORE0_LSB    _u(4)
#define ACCESSCTRL_TIMER0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_SP
// Description : If 1, TIMER0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_TIMER0_SP_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_TIMER0_SP_MSB    _u(3)
#define ACCESSCTRL_TIMER0_SP_LSB    _u(3)
#define ACCESSCTRL_TIMER0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_SU
// Description : If 1, and SP is also set, TIMER0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_TIMER0_SU_RESET  _u(0x1)
#define ACCESSCTRL_TIMER0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_TIMER0_SU_MSB    _u(2)
#define ACCESSCTRL_TIMER0_SU_LSB    _u(2)
#define ACCESSCTRL_TIMER0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_NSP
// Description : If 1, TIMER0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_TIMER0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_TIMER0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_TIMER0_NSP_MSB    _u(1)
#define ACCESSCTRL_TIMER0_NSP_LSB    _u(1)
#define ACCESSCTRL_TIMER0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER0_NSU
// Description : If 1, and NSP is also set, TIMER0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_TIMER0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_TIMER0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_TIMER0_NSU_MSB    _u(0)
#define ACCESSCTRL_TIMER0_NSU_LSB    _u(0)
#define ACCESSCTRL_TIMER0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_TIMER1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               TIMER1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
