Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_TIMER1_OFFSET _u(0x0000009c)
#define ACCESSCTRL_TIMER1_BITS   _u(0x000000ff)
#define ACCESSCTRL_TIMER1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_DBG
// Description : If 1, TIMER1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_TIMER1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_TIMER1_DBG_MSB    _u(7)
#define ACCESSCTRL_TIMER1_DBG_LSB    _u(7)
#define ACCESSCTRL_TIMER1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_DMA
// Description : If 1, TIMER1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_TIMER1_DMA_MSB    _u(6)
#define ACCESSCTRL_TIMER1_DMA_LSB    _u(6)
#define ACCESSCTRL_TIMER1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_CORE1
// Description : If 1, TIMER1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_TIMER1_CORE1_MSB    _u(5)
#define ACCESSCTRL_TIMER1_CORE1_LSB    _u(5)
#define ACCESSCTRL_TIMER1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_CORE0
// Description : If 1, TIMER1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TIMER1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_TIMER1_CORE0_MSB    _u(4)
#define ACCESSCTRL_TIMER1_CORE0_LSB    _u(4)
#define ACCESSCTRL_TIMER1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_SP
// Description : If 1, TIMER1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_TIMER1_SP_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_TIMER1_SP_MSB    _u(3)
#define ACCESSCTRL_TIMER1_SP_LSB    _u(3)
#define ACCESSCTRL_TIMER1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_SU
// Description : If 1, and SP is also set, TIMER1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_TIMER1_SU_RESET  _u(0x1)
#define ACCESSCTRL_TIMER1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_TIMER1_SU_MSB    _u(2)
#define ACCESSCTRL_TIMER1_SU_LSB    _u(2)
#define ACCESSCTRL_TIMER1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_NSP
// Description : If 1, TIMER1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_TIMER1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_TIMER1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_TIMER1_NSP_MSB    _u(1)
#define ACCESSCTRL_TIMER1_NSP_LSB    _u(1)
#define ACCESSCTRL_TIMER1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TIMER1_NSU
// Description : If 1, and NSP is also set, TIMER1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_TIMER1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_TIMER1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_TIMER1_NSU_MSB    _u(0)
#define ACCESSCTRL_TIMER1_NSU_LSB    _u(0)
#define ACCESSCTRL_TIMER1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_UART0
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               UART0, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_UART0_OFFSET _u(0x000000a0)
#define ACCESSCTRL_UART0_BITS   _u(0x000000ff)
#define ACCESSCTRL_UART0_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_DBG
// Description : If 1, UART0 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_UART0_DBG_RESET  _u(0x1)
#define ACCESSCTRL_UART0_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_UART0_DBG_MSB    _u(7)
#define ACCESSCTRL_UART0_DBG_LSB    _u(7)
#define ACCESSCTRL_UART0_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_DMA
// Description : If 1, UART0 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART0_DMA_RESET  _u(0x1)
#define ACCESSCTRL_UART0_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_UART0_DMA_MSB    _u(6)
#define ACCESSCTRL_UART0_DMA_LSB    _u(6)
#define ACCESSCTRL_UART0_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_CORE1
// Description : If 1, UART0 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART0_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_UART0_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_UART0_CORE1_MSB    _u(5)
#define ACCESSCTRL_UART0_CORE1_LSB    _u(5)
#define ACCESSCTRL_UART0_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_CORE0
// Description : If 1, UART0 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART0_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_UART0_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_UART0_CORE0_MSB    _u(4)
#define ACCESSCTRL_UART0_CORE0_LSB    _u(4)
#define ACCESSCTRL_UART0_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_SP
// Description : If 1, UART0 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_UART0_SP_RESET  _u(0x1)
#define ACCESSCTRL_UART0_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_UART0_SP_MSB    _u(3)
#define ACCESSCTRL_UART0_SP_LSB    _u(3)
#define ACCESSCTRL_UART0_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_SU
// Description : If 1, and SP is also set, UART0 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_UART0_SU_RESET  _u(0x1)
#define ACCESSCTRL_UART0_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_UART0_SU_MSB    _u(2)
#define ACCESSCTRL_UART0_SU_LSB    _u(2)
#define ACCESSCTRL_UART0_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_NSP
// Description : If 1, UART0 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_UART0_NSP_RESET  _u(0x0)
#define ACCESSCTRL_UART0_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_UART0_NSP_MSB    _u(1)
#define ACCESSCTRL_UART0_NSP_LSB    _u(1)
#define ACCESSCTRL_UART0_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART0_NSU
// Description : If 1, and NSP is also set, UART0 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_UART0_NSU_RESET  _u(0x0)
#define ACCESSCTRL_UART0_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_UART0_NSU_MSB    _u(0)
#define ACCESSCTRL_UART0_NSU_LSB    _u(0)
#define ACCESSCTRL_UART0_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_UART1
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               UART1, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_UART1_OFFSET _u(0x000000a4)
#define ACCESSCTRL_UART1_BITS   _u(0x000000ff)
#define ACCESSCTRL_UART1_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_DBG
// Description : If 1, UART1 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_UART1_DBG_RESET  _u(0x1)
#define ACCESSCTRL_UART1_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_UART1_DBG_MSB    _u(7)
#define ACCESSCTRL_UART1_DBG_LSB    _u(7)
#define ACCESSCTRL_UART1_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_DMA
// Description : If 1, UART1 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART1_DMA_RESET  _u(0x1)
#define ACCESSCTRL_UART1_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_UART1_DMA_MSB    _u(6)
#define ACCESSCTRL_UART1_DMA_LSB    _u(6)
#define ACCESSCTRL_UART1_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_CORE1
// Description : If 1, UART1 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART1_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_UART1_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_UART1_CORE1_MSB    _u(5)
#define ACCESSCTRL_UART1_CORE1_LSB    _u(5)
#define ACCESSCTRL_UART1_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_CORE0
// Description : If 1, UART1 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_UART1_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_UART1_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_UART1_CORE0_MSB    _u(4)
#define ACCESSCTRL_UART1_CORE0_LSB    _u(4)
#define ACCESSCTRL_UART1_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_SP
// Description : If 1, UART1 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_UART1_SP_RESET  _u(0x1)
#define ACCESSCTRL_UART1_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_UART1_SP_MSB    _u(3)
#define ACCESSCTRL_UART1_SP_LSB    _u(3)
#define ACCESSCTRL_UART1_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_SU
// Description : If 1, and SP is also set, UART1 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_UART1_SU_RESET  _u(0x1)
#define ACCESSCTRL_UART1_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_UART1_SU_MSB    _u(2)
#define ACCESSCTRL_UART1_SU_LSB    _u(2)
#define ACCESSCTRL_UART1_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_NSP
// Description : If 1, UART1 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_UART1_NSP_RESET  _u(0x0)
#define ACCESSCTRL_UART1_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_UART1_NSP_MSB    _u(1)
#define ACCESSCTRL_UART1_NSP_LSB    _u(1)
#define ACCESSCTRL_UART1_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_UART1_NSU
// Description : If 1, and NSP is also set, UART1 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_UART1_NSU_RESET  _u(0x0)
#define ACCESSCTRL_UART1_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_UART1_NSU_MSB    _u(0)
#define ACCESSCTRL_UART1_NSU_LSB    _u(0)
#define ACCESSCTRL_UART1_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_OTP
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               OTP, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_OTP_OFFSET _u(0x000000a8)
#define ACCESSCTRL_OTP_BITS   _u(0x000000ff)
#define ACCESSCTRL_OTP_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_DBG
// Description : If 1, OTP can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_OTP_DBG_RESET  _u(0x1)
#define ACCESSCTRL_OTP_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_OTP_DBG_MSB    _u(7)
#define ACCESSCTRL_OTP_DBG_LSB    _u(7)
#define ACCESSCTRL_OTP_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_DMA
// Description : If 1, OTP can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_OTP_DMA_RESET  _u(0x1)
#define ACCESSCTRL_OTP_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_OTP_DMA_MSB    _u(6)
#define ACCESSCTRL_OTP_DMA_LSB    _u(6)
#define ACCESSCTRL_OTP_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_CORE1
// Description : If 1, OTP can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_OTP_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_OTP_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_OTP_CORE1_MSB    _u(5)
#define ACCESSCTRL_OTP_CORE1_LSB    _u(5)
#define ACCESSCTRL_OTP_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_CORE0
// Description : If 1, OTP can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_OTP_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_OTP_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_OTP_CORE0_MSB    _u(4)
#define ACCESSCTRL_OTP_CORE0_LSB    _u(4)
#define ACCESSCTRL_OTP_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_SP
// Description : If 1, OTP can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_OTP_SP_RESET  _u(0x1)
#define ACCESSCTRL_OTP_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_OTP_SP_MSB    _u(3)
#define ACCESSCTRL_OTP_SP_LSB    _u(3)
#define ACCESSCTRL_OTP_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_SU
// Description : If 1, and SP is also set, OTP can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_OTP_SU_RESET  _u(0x1)
#define ACCESSCTRL_OTP_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_OTP_SU_MSB    _u(2)
#define ACCESSCTRL_OTP_SU_LSB    _u(2)
#define ACCESSCTRL_OTP_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_NSP
// Description : If 1, OTP can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_OTP_NSP_RESET  _u(0x0)
#define ACCESSCTRL_OTP_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_OTP_NSP_MSB    _u(1)
#define ACCESSCTRL_OTP_NSP_LSB    _u(1)
#define ACCESSCTRL_OTP_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_OTP_NSU
// Description : If 1, and NSP is also set, OTP can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_OTP_NSU_RESET  _u(0x0)
#define ACCESSCTRL_OTP_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_OTP_NSU_MSB    _u(0)
#define ACCESSCTRL_OTP_NSU_LSB    _u(0)
#define ACCESSCTRL_OTP_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_TBMAN
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               TBMAN, and at what security/privilege levels they can do so.
//
//               Defaults to Secure access from any master.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_TBMAN_OFFSET _u(0x000000ac)
#define ACCESSCTRL_TBMAN_BITS   _u(0x000000ff)
#define ACCESSCTRL_TBMAN_RESET  _u(0x000000fc)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_DBG
// Description : If 1, TBMAN can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_TBMAN_DBG_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_TBMAN_DBG_MSB    _u(7)
#define ACCESSCTRL_TBMAN_DBG_LSB    _u(7)
#define ACCESSCTRL_TBMAN_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_DMA
// Description : If 1, TBMAN can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TBMAN_DMA_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_TBMAN_DMA_MSB    _u(6)
#define ACCESSCTRL_TBMAN_DMA_LSB    _u(6)
#define ACCESSCTRL_TBMAN_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_CORE1
// Description : If 1, TBMAN can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TBMAN_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_TBMAN_CORE1_MSB    _u(5)
#define ACCESSCTRL_TBMAN_CORE1_LSB    _u(5)
#define ACCESSCTRL_TBMAN_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_CORE0
// Description : If 1, TBMAN can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TBMAN_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_TBMAN_CORE0_MSB    _u(4)
#define ACCESSCTRL_TBMAN_CORE0_LSB    _u(4)
#define ACCESSCTRL_TBMAN_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_SP
// Description : If 1, TBMAN can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_TBMAN_SP_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_TBMAN_SP_MSB    _u(3)
#define ACCESSCTRL_TBMAN_SP_LSB    _u(3)
#define ACCESSCTRL_TBMAN_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_SU
// Description : If 1, and SP is also set, TBMAN can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_TBMAN_SU_RESET  _u(0x1)
#define ACCESSCTRL_TBMAN_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_TBMAN_SU_MSB    _u(2)
#define ACCESSCTRL_TBMAN_SU_LSB    _u(2)
#define ACCESSCTRL_TBMAN_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_NSP
// Description : If 1, TBMAN can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_TBMAN_NSP_RESET  _u(0x0)
#define ACCESSCTRL_TBMAN_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_TBMAN_NSP_MSB    _u(1)
#define ACCESSCTRL_TBMAN_NSP_LSB    _u(1)
#define ACCESSCTRL_TBMAN_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TBMAN_NSU
// Description : If 1, and NSP is also set, TBMAN can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_TBMAN_NSU_RESET  _u(0x0)
#define ACCESSCTRL_TBMAN_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_TBMAN_NSU_MSB    _u(0)
#define ACCESSCTRL_TBMAN_NSU_LSB    _u(0)
#define ACCESSCTRL_TBMAN_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_POWMAN
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               POWMAN, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_POWMAN_OFFSET _u(0x000000b0)
#define ACCESSCTRL_POWMAN_BITS   _u(0x000000ff)
#define ACCESSCTRL_POWMAN_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_DBG
// Description : If 1, POWMAN can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_POWMAN_DBG_RESET  _u(0x1)
#define ACCESSCTRL_POWMAN_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_POWMAN_DBG_MSB    _u(7)
#define ACCESSCTRL_POWMAN_DBG_LSB    _u(7)
#define ACCESSCTRL_POWMAN_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
