Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
// Field       : ACCESSCTRL_POWMAN_DMA
// Description : If 1, POWMAN can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_POWMAN_DMA_RESET  _u(0x0)
#define ACCESSCTRL_POWMAN_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_POWMAN_DMA_MSB    _u(6)
#define ACCESSCTRL_POWMAN_DMA_LSB    _u(6)
#define ACCESSCTRL_POWMAN_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_CORE1
// Description : If 1, POWMAN can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_POWMAN_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_POWMAN_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_POWMAN_CORE1_MSB    _u(5)
#define ACCESSCTRL_POWMAN_CORE1_LSB    _u(5)
#define ACCESSCTRL_POWMAN_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_CORE0
// Description : If 1, POWMAN can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_POWMAN_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_POWMAN_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_POWMAN_CORE0_MSB    _u(4)
#define ACCESSCTRL_POWMAN_CORE0_LSB    _u(4)
#define ACCESSCTRL_POWMAN_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_SP
// Description : If 1, POWMAN can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_POWMAN_SP_RESET  _u(0x1)
#define ACCESSCTRL_POWMAN_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_POWMAN_SP_MSB    _u(3)
#define ACCESSCTRL_POWMAN_SP_LSB    _u(3)
#define ACCESSCTRL_POWMAN_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_SU
// Description : If 1, and SP is also set, POWMAN can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_POWMAN_SU_RESET  _u(0x0)
#define ACCESSCTRL_POWMAN_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_POWMAN_SU_MSB    _u(2)
#define ACCESSCTRL_POWMAN_SU_LSB    _u(2)
#define ACCESSCTRL_POWMAN_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_NSP
// Description : If 1, POWMAN can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_POWMAN_NSP_RESET  _u(0x0)
#define ACCESSCTRL_POWMAN_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_POWMAN_NSP_MSB    _u(1)
#define ACCESSCTRL_POWMAN_NSP_LSB    _u(1)
#define ACCESSCTRL_POWMAN_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_POWMAN_NSU
// Description : If 1, and NSP is also set, POWMAN can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_POWMAN_NSU_RESET  _u(0x0)
#define ACCESSCTRL_POWMAN_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_POWMAN_NSU_MSB    _u(0)
#define ACCESSCTRL_POWMAN_NSU_LSB    _u(0)
#define ACCESSCTRL_POWMAN_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_TRNG
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               TRNG, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_TRNG_OFFSET _u(0x000000b4)
#define ACCESSCTRL_TRNG_BITS   _u(0x000000ff)
#define ACCESSCTRL_TRNG_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_DBG
// Description : If 1, TRNG can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_TRNG_DBG_RESET  _u(0x1)
#define ACCESSCTRL_TRNG_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_TRNG_DBG_MSB    _u(7)
#define ACCESSCTRL_TRNG_DBG_LSB    _u(7)
#define ACCESSCTRL_TRNG_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_DMA
// Description : If 1, TRNG can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TRNG_DMA_RESET  _u(0x0)
#define ACCESSCTRL_TRNG_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_TRNG_DMA_MSB    _u(6)
#define ACCESSCTRL_TRNG_DMA_LSB    _u(6)
#define ACCESSCTRL_TRNG_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_CORE1
// Description : If 1, TRNG can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TRNG_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_TRNG_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_TRNG_CORE1_MSB    _u(5)
#define ACCESSCTRL_TRNG_CORE1_LSB    _u(5)
#define ACCESSCTRL_TRNG_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_CORE0
// Description : If 1, TRNG can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TRNG_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_TRNG_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_TRNG_CORE0_MSB    _u(4)
#define ACCESSCTRL_TRNG_CORE0_LSB    _u(4)
#define ACCESSCTRL_TRNG_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_SP
// Description : If 1, TRNG can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_TRNG_SP_RESET  _u(0x1)
#define ACCESSCTRL_TRNG_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_TRNG_SP_MSB    _u(3)
#define ACCESSCTRL_TRNG_SP_LSB    _u(3)
#define ACCESSCTRL_TRNG_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_SU
// Description : If 1, and SP is also set, TRNG can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_TRNG_SU_RESET  _u(0x0)
#define ACCESSCTRL_TRNG_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_TRNG_SU_MSB    _u(2)
#define ACCESSCTRL_TRNG_SU_LSB    _u(2)
#define ACCESSCTRL_TRNG_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_NSP
// Description : If 1, TRNG can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_TRNG_NSP_RESET  _u(0x0)
#define ACCESSCTRL_TRNG_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_TRNG_NSP_MSB    _u(1)
#define ACCESSCTRL_TRNG_NSP_LSB    _u(1)
#define ACCESSCTRL_TRNG_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TRNG_NSU
// Description : If 1, and NSP is also set, TRNG can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_TRNG_NSU_RESET  _u(0x0)
#define ACCESSCTRL_TRNG_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_TRNG_NSU_MSB    _u(0)
#define ACCESSCTRL_TRNG_NSU_LSB    _u(0)
#define ACCESSCTRL_TRNG_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SHA256
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SHA256, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SHA256_OFFSET _u(0x000000b8)
#define ACCESSCTRL_SHA256_BITS   _u(0x000000ff)
#define ACCESSCTRL_SHA256_RESET  _u(0x000000f8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_DBG
// Description : If 1, SHA256 can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SHA256_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SHA256_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SHA256_DBG_MSB    _u(7)
#define ACCESSCTRL_SHA256_DBG_LSB    _u(7)
#define ACCESSCTRL_SHA256_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_DMA
// Description : If 1, SHA256 can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SHA256_DMA_RESET  _u(0x1)
#define ACCESSCTRL_SHA256_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SHA256_DMA_MSB    _u(6)
#define ACCESSCTRL_SHA256_DMA_LSB    _u(6)
#define ACCESSCTRL_SHA256_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_CORE1
// Description : If 1, SHA256 can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SHA256_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SHA256_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SHA256_CORE1_MSB    _u(5)
#define ACCESSCTRL_SHA256_CORE1_LSB    _u(5)
#define ACCESSCTRL_SHA256_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_CORE0
// Description : If 1, SHA256 can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SHA256_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SHA256_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SHA256_CORE0_MSB    _u(4)
#define ACCESSCTRL_SHA256_CORE0_LSB    _u(4)
#define ACCESSCTRL_SHA256_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_SP
// Description : If 1, SHA256 can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SHA256_SP_RESET  _u(0x1)
#define ACCESSCTRL_SHA256_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SHA256_SP_MSB    _u(3)
#define ACCESSCTRL_SHA256_SP_LSB    _u(3)
#define ACCESSCTRL_SHA256_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_SU
// Description : If 1, and SP is also set, SHA256 can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SHA256_SU_RESET  _u(0x0)
#define ACCESSCTRL_SHA256_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SHA256_SU_MSB    _u(2)
#define ACCESSCTRL_SHA256_SU_LSB    _u(2)
#define ACCESSCTRL_SHA256_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_NSP
// Description : If 1, SHA256 can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SHA256_NSP_RESET  _u(0x0)
#define ACCESSCTRL_SHA256_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SHA256_NSP_MSB    _u(1)
#define ACCESSCTRL_SHA256_NSP_LSB    _u(1)
#define ACCESSCTRL_SHA256_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SHA256_NSU
// Description : If 1, and NSP is also set, SHA256 can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SHA256_NSU_RESET  _u(0x0)
#define ACCESSCTRL_SHA256_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SHA256_NSU_MSB    _u(0)
#define ACCESSCTRL_SHA256_NSU_LSB    _u(0)
#define ACCESSCTRL_SHA256_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_SYSCFG
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               SYSCFG, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_SYSCFG_OFFSET _u(0x000000bc)
#define ACCESSCTRL_SYSCFG_BITS   _u(0x000000ff)
#define ACCESSCTRL_SYSCFG_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_DBG
// Description : If 1, SYSCFG can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_SYSCFG_DBG_RESET  _u(0x1)
#define ACCESSCTRL_SYSCFG_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_SYSCFG_DBG_MSB    _u(7)
#define ACCESSCTRL_SYSCFG_DBG_LSB    _u(7)
#define ACCESSCTRL_SYSCFG_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_DMA
// Description : If 1, SYSCFG can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSCFG_DMA_RESET  _u(0x0)
#define ACCESSCTRL_SYSCFG_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_SYSCFG_DMA_MSB    _u(6)
#define ACCESSCTRL_SYSCFG_DMA_LSB    _u(6)
#define ACCESSCTRL_SYSCFG_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_CORE1
// Description : If 1, SYSCFG can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSCFG_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_SYSCFG_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_SYSCFG_CORE1_MSB    _u(5)
#define ACCESSCTRL_SYSCFG_CORE1_LSB    _u(5)
#define ACCESSCTRL_SYSCFG_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_CORE0
// Description : If 1, SYSCFG can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_SYSCFG_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_SYSCFG_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_SYSCFG_CORE0_MSB    _u(4)
#define ACCESSCTRL_SYSCFG_CORE0_LSB    _u(4)
#define ACCESSCTRL_SYSCFG_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_SP
// Description : If 1, SYSCFG can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_SYSCFG_SP_RESET  _u(0x1)
#define ACCESSCTRL_SYSCFG_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_SYSCFG_SP_MSB    _u(3)
#define ACCESSCTRL_SYSCFG_SP_LSB    _u(3)
#define ACCESSCTRL_SYSCFG_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_SU
// Description : If 1, and SP is also set, SYSCFG can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_SYSCFG_SU_RESET  _u(0x0)
#define ACCESSCTRL_SYSCFG_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_SYSCFG_SU_MSB    _u(2)
#define ACCESSCTRL_SYSCFG_SU_LSB    _u(2)
#define ACCESSCTRL_SYSCFG_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_NSP
// Description : If 1, SYSCFG can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_SYSCFG_NSP_RESET  _u(0x0)
#define ACCESSCTRL_SYSCFG_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_SYSCFG_NSP_MSB    _u(1)
#define ACCESSCTRL_SYSCFG_NSP_LSB    _u(1)
#define ACCESSCTRL_SYSCFG_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_SYSCFG_NSU
// Description : If 1, and NSP is also set, SYSCFG can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_SYSCFG_NSU_RESET  _u(0x0)
#define ACCESSCTRL_SYSCFG_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_SYSCFG_NSU_MSB    _u(0)
#define ACCESSCTRL_SYSCFG_NSU_LSB    _u(0)
#define ACCESSCTRL_SYSCFG_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_CLOCKS
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               CLOCKS, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_CLOCKS_OFFSET _u(0x000000c0)
#define ACCESSCTRL_CLOCKS_BITS   _u(0x000000ff)
#define ACCESSCTRL_CLOCKS_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_DBG
// Description : If 1, CLOCKS can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_CLOCKS_DBG_RESET  _u(0x1)
#define ACCESSCTRL_CLOCKS_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_CLOCKS_DBG_MSB    _u(7)
#define ACCESSCTRL_CLOCKS_DBG_LSB    _u(7)
#define ACCESSCTRL_CLOCKS_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_DMA
// Description : If 1, CLOCKS can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_CLOCKS_DMA_RESET  _u(0x0)
#define ACCESSCTRL_CLOCKS_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_CLOCKS_DMA_MSB    _u(6)
#define ACCESSCTRL_CLOCKS_DMA_LSB    _u(6)
#define ACCESSCTRL_CLOCKS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_CORE1
// Description : If 1, CLOCKS can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_CLOCKS_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_CLOCKS_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_CLOCKS_CORE1_MSB    _u(5)
#define ACCESSCTRL_CLOCKS_CORE1_LSB    _u(5)
#define ACCESSCTRL_CLOCKS_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_CORE0
// Description : If 1, CLOCKS can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_CLOCKS_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_CLOCKS_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_CLOCKS_CORE0_MSB    _u(4)
#define ACCESSCTRL_CLOCKS_CORE0_LSB    _u(4)
#define ACCESSCTRL_CLOCKS_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_SP
// Description : If 1, CLOCKS can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_CLOCKS_SP_RESET  _u(0x1)
#define ACCESSCTRL_CLOCKS_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_CLOCKS_SP_MSB    _u(3)
#define ACCESSCTRL_CLOCKS_SP_LSB    _u(3)
#define ACCESSCTRL_CLOCKS_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_SU
// Description : If 1, and SP is also set, CLOCKS can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_CLOCKS_SU_RESET  _u(0x0)
#define ACCESSCTRL_CLOCKS_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_CLOCKS_SU_MSB    _u(2)
#define ACCESSCTRL_CLOCKS_SU_LSB    _u(2)
#define ACCESSCTRL_CLOCKS_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_NSP
// Description : If 1, CLOCKS can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_CLOCKS_NSP_RESET  _u(0x0)
#define ACCESSCTRL_CLOCKS_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_CLOCKS_NSP_MSB    _u(1)
#define ACCESSCTRL_CLOCKS_NSP_LSB    _u(1)
#define ACCESSCTRL_CLOCKS_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_CLOCKS_NSU
// Description : If 1, and NSP is also set, CLOCKS can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_CLOCKS_NSU_RESET  _u(0x0)
#define ACCESSCTRL_CLOCKS_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_CLOCKS_NSU_MSB    _u(0)
#define ACCESSCTRL_CLOCKS_NSU_LSB    _u(0)
#define ACCESSCTRL_CLOCKS_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_XOSC
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               XOSC, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_XOSC_OFFSET _u(0x000000c4)
#define ACCESSCTRL_XOSC_BITS   _u(0x000000ff)
#define ACCESSCTRL_XOSC_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_DBG
// Description : If 1, XOSC can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XOSC_DBG_RESET  _u(0x1)
#define ACCESSCTRL_XOSC_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_XOSC_DBG_MSB    _u(7)
#define ACCESSCTRL_XOSC_DBG_LSB    _u(7)
#define ACCESSCTRL_XOSC_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_DMA
// Description : If 1, XOSC can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XOSC_DMA_RESET  _u(0x0)
#define ACCESSCTRL_XOSC_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_XOSC_DMA_MSB    _u(6)
#define ACCESSCTRL_XOSC_DMA_LSB    _u(6)
#define ACCESSCTRL_XOSC_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_CORE1
// Description : If 1, XOSC can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XOSC_CORE1_RESET  _u(0x1)
