Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_XOSC_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_XOSC_CORE1_MSB    _u(5)
#define ACCESSCTRL_XOSC_CORE1_LSB    _u(5)
#define ACCESSCTRL_XOSC_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_CORE0
// Description : If 1, XOSC can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XOSC_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_XOSC_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_XOSC_CORE0_MSB    _u(4)
#define ACCESSCTRL_XOSC_CORE0_LSB    _u(4)
#define ACCESSCTRL_XOSC_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_SP
// Description : If 1, XOSC can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_XOSC_SP_RESET  _u(0x1)
#define ACCESSCTRL_XOSC_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_XOSC_SP_MSB    _u(3)
#define ACCESSCTRL_XOSC_SP_LSB    _u(3)
#define ACCESSCTRL_XOSC_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_SU
// Description : If 1, and SP is also set, XOSC can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_XOSC_SU_RESET  _u(0x0)
#define ACCESSCTRL_XOSC_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_XOSC_SU_MSB    _u(2)
#define ACCESSCTRL_XOSC_SU_LSB    _u(2)
#define ACCESSCTRL_XOSC_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_NSP
// Description : If 1, XOSC can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_XOSC_NSP_RESET  _u(0x0)
#define ACCESSCTRL_XOSC_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_XOSC_NSP_MSB    _u(1)
#define ACCESSCTRL_XOSC_NSP_LSB    _u(1)
#define ACCESSCTRL_XOSC_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XOSC_NSU
// Description : If 1, and NSP is also set, XOSC can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_XOSC_NSU_RESET  _u(0x0)
#define ACCESSCTRL_XOSC_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_XOSC_NSU_MSB    _u(0)
#define ACCESSCTRL_XOSC_NSU_LSB    _u(0)
#define ACCESSCTRL_XOSC_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_ROSC
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               ROSC, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_ROSC_OFFSET _u(0x000000c8)
#define ACCESSCTRL_ROSC_BITS   _u(0x000000ff)
#define ACCESSCTRL_ROSC_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_DBG
// Description : If 1, ROSC can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_ROSC_DBG_RESET  _u(0x1)
#define ACCESSCTRL_ROSC_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_ROSC_DBG_MSB    _u(7)
#define ACCESSCTRL_ROSC_DBG_LSB    _u(7)
#define ACCESSCTRL_ROSC_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_DMA
// Description : If 1, ROSC can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROSC_DMA_RESET  _u(0x0)
#define ACCESSCTRL_ROSC_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_ROSC_DMA_MSB    _u(6)
#define ACCESSCTRL_ROSC_DMA_LSB    _u(6)
#define ACCESSCTRL_ROSC_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_CORE1
// Description : If 1, ROSC can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROSC_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_ROSC_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_ROSC_CORE1_MSB    _u(5)
#define ACCESSCTRL_ROSC_CORE1_LSB    _u(5)
#define ACCESSCTRL_ROSC_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_CORE0
// Description : If 1, ROSC can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_ROSC_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_ROSC_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_ROSC_CORE0_MSB    _u(4)
#define ACCESSCTRL_ROSC_CORE0_LSB    _u(4)
#define ACCESSCTRL_ROSC_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_SP
// Description : If 1, ROSC can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_ROSC_SP_RESET  _u(0x1)
#define ACCESSCTRL_ROSC_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_ROSC_SP_MSB    _u(3)
#define ACCESSCTRL_ROSC_SP_LSB    _u(3)
#define ACCESSCTRL_ROSC_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_SU
// Description : If 1, and SP is also set, ROSC can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_ROSC_SU_RESET  _u(0x0)
#define ACCESSCTRL_ROSC_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_ROSC_SU_MSB    _u(2)
#define ACCESSCTRL_ROSC_SU_LSB    _u(2)
#define ACCESSCTRL_ROSC_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_NSP
// Description : If 1, ROSC can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_ROSC_NSP_RESET  _u(0x0)
#define ACCESSCTRL_ROSC_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_ROSC_NSP_MSB    _u(1)
#define ACCESSCTRL_ROSC_NSP_LSB    _u(1)
#define ACCESSCTRL_ROSC_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_ROSC_NSU
// Description : If 1, and NSP is also set, ROSC can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_ROSC_NSU_RESET  _u(0x0)
#define ACCESSCTRL_ROSC_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_ROSC_NSU_MSB    _u(0)
#define ACCESSCTRL_ROSC_NSU_LSB    _u(0)
#define ACCESSCTRL_ROSC_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PLL_SYS
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PLL_SYS, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PLL_SYS_OFFSET _u(0x000000cc)
#define ACCESSCTRL_PLL_SYS_BITS   _u(0x000000ff)
#define ACCESSCTRL_PLL_SYS_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_DBG
// Description : If 1, PLL_SYS can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PLL_SYS_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PLL_SYS_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PLL_SYS_DBG_MSB    _u(7)
#define ACCESSCTRL_PLL_SYS_DBG_LSB    _u(7)
#define ACCESSCTRL_PLL_SYS_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_DMA
// Description : If 1, PLL_SYS can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_SYS_DMA_RESET  _u(0x0)
#define ACCESSCTRL_PLL_SYS_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PLL_SYS_DMA_MSB    _u(6)
#define ACCESSCTRL_PLL_SYS_DMA_LSB    _u(6)
#define ACCESSCTRL_PLL_SYS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_CORE1
// Description : If 1, PLL_SYS can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_SYS_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PLL_SYS_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PLL_SYS_CORE1_MSB    _u(5)
#define ACCESSCTRL_PLL_SYS_CORE1_LSB    _u(5)
#define ACCESSCTRL_PLL_SYS_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_CORE0
// Description : If 1, PLL_SYS can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_SYS_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PLL_SYS_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PLL_SYS_CORE0_MSB    _u(4)
#define ACCESSCTRL_PLL_SYS_CORE0_LSB    _u(4)
#define ACCESSCTRL_PLL_SYS_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_SP
// Description : If 1, PLL_SYS can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_PLL_SYS_SP_RESET  _u(0x1)
#define ACCESSCTRL_PLL_SYS_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PLL_SYS_SP_MSB    _u(3)
#define ACCESSCTRL_PLL_SYS_SP_LSB    _u(3)
#define ACCESSCTRL_PLL_SYS_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_SU
// Description : If 1, and SP is also set, PLL_SYS can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_PLL_SYS_SU_RESET  _u(0x0)
#define ACCESSCTRL_PLL_SYS_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PLL_SYS_SU_MSB    _u(2)
#define ACCESSCTRL_PLL_SYS_SU_LSB    _u(2)
#define ACCESSCTRL_PLL_SYS_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_NSP
// Description : If 1, PLL_SYS can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PLL_SYS_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PLL_SYS_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PLL_SYS_NSP_MSB    _u(1)
#define ACCESSCTRL_PLL_SYS_NSP_LSB    _u(1)
#define ACCESSCTRL_PLL_SYS_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_SYS_NSU
// Description : If 1, and NSP is also set, PLL_SYS can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PLL_SYS_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PLL_SYS_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PLL_SYS_NSU_MSB    _u(0)
#define ACCESSCTRL_PLL_SYS_NSU_LSB    _u(0)
#define ACCESSCTRL_PLL_SYS_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_PLL_USB
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               PLL_USB, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_PLL_USB_OFFSET _u(0x000000d0)
#define ACCESSCTRL_PLL_USB_BITS   _u(0x000000ff)
#define ACCESSCTRL_PLL_USB_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_DBG
// Description : If 1, PLL_USB can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_PLL_USB_DBG_RESET  _u(0x1)
#define ACCESSCTRL_PLL_USB_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_PLL_USB_DBG_MSB    _u(7)
#define ACCESSCTRL_PLL_USB_DBG_LSB    _u(7)
#define ACCESSCTRL_PLL_USB_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_DMA
// Description : If 1, PLL_USB can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_USB_DMA_RESET  _u(0x0)
#define ACCESSCTRL_PLL_USB_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_PLL_USB_DMA_MSB    _u(6)
#define ACCESSCTRL_PLL_USB_DMA_LSB    _u(6)
#define ACCESSCTRL_PLL_USB_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_CORE1
// Description : If 1, PLL_USB can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_USB_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_PLL_USB_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_PLL_USB_CORE1_MSB    _u(5)
#define ACCESSCTRL_PLL_USB_CORE1_LSB    _u(5)
#define ACCESSCTRL_PLL_USB_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_CORE0
// Description : If 1, PLL_USB can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_PLL_USB_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_PLL_USB_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_PLL_USB_CORE0_MSB    _u(4)
#define ACCESSCTRL_PLL_USB_CORE0_LSB    _u(4)
#define ACCESSCTRL_PLL_USB_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_SP
// Description : If 1, PLL_USB can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_PLL_USB_SP_RESET  _u(0x1)
#define ACCESSCTRL_PLL_USB_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_PLL_USB_SP_MSB    _u(3)
#define ACCESSCTRL_PLL_USB_SP_LSB    _u(3)
#define ACCESSCTRL_PLL_USB_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_SU
// Description : If 1, and SP is also set, PLL_USB can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_PLL_USB_SU_RESET  _u(0x0)
#define ACCESSCTRL_PLL_USB_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_PLL_USB_SU_MSB    _u(2)
#define ACCESSCTRL_PLL_USB_SU_LSB    _u(2)
#define ACCESSCTRL_PLL_USB_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_NSP
// Description : If 1, PLL_USB can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_PLL_USB_NSP_RESET  _u(0x0)
#define ACCESSCTRL_PLL_USB_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_PLL_USB_NSP_MSB    _u(1)
#define ACCESSCTRL_PLL_USB_NSP_LSB    _u(1)
#define ACCESSCTRL_PLL_USB_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_PLL_USB_NSU
// Description : If 1, and NSP is also set, PLL_USB can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_PLL_USB_NSU_RESET  _u(0x0)
#define ACCESSCTRL_PLL_USB_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_PLL_USB_NSU_MSB    _u(0)
#define ACCESSCTRL_PLL_USB_NSU_LSB    _u(0)
#define ACCESSCTRL_PLL_USB_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_TICKS
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               TICKS, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_TICKS_OFFSET _u(0x000000d4)
#define ACCESSCTRL_TICKS_BITS   _u(0x000000ff)
#define ACCESSCTRL_TICKS_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_DBG
// Description : If 1, TICKS can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_TICKS_DBG_RESET  _u(0x1)
#define ACCESSCTRL_TICKS_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_TICKS_DBG_MSB    _u(7)
#define ACCESSCTRL_TICKS_DBG_LSB    _u(7)
#define ACCESSCTRL_TICKS_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_DMA
// Description : If 1, TICKS can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TICKS_DMA_RESET  _u(0x0)
#define ACCESSCTRL_TICKS_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_TICKS_DMA_MSB    _u(6)
#define ACCESSCTRL_TICKS_DMA_LSB    _u(6)
#define ACCESSCTRL_TICKS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_CORE1
// Description : If 1, TICKS can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TICKS_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_TICKS_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_TICKS_CORE1_MSB    _u(5)
#define ACCESSCTRL_TICKS_CORE1_LSB    _u(5)
#define ACCESSCTRL_TICKS_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_CORE0
// Description : If 1, TICKS can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_TICKS_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_TICKS_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_TICKS_CORE0_MSB    _u(4)
#define ACCESSCTRL_TICKS_CORE0_LSB    _u(4)
#define ACCESSCTRL_TICKS_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_SP
// Description : If 1, TICKS can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_TICKS_SP_RESET  _u(0x1)
#define ACCESSCTRL_TICKS_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_TICKS_SP_MSB    _u(3)
#define ACCESSCTRL_TICKS_SP_LSB    _u(3)
#define ACCESSCTRL_TICKS_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_SU
// Description : If 1, and SP is also set, TICKS can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_TICKS_SU_RESET  _u(0x0)
#define ACCESSCTRL_TICKS_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_TICKS_SU_MSB    _u(2)
#define ACCESSCTRL_TICKS_SU_LSB    _u(2)
#define ACCESSCTRL_TICKS_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_NSP
// Description : If 1, TICKS can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_TICKS_NSP_RESET  _u(0x0)
#define ACCESSCTRL_TICKS_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_TICKS_NSP_MSB    _u(1)
#define ACCESSCTRL_TICKS_NSP_LSB    _u(1)
#define ACCESSCTRL_TICKS_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_TICKS_NSU
// Description : If 1, and NSP is also set, TICKS can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_TICKS_NSU_RESET  _u(0x0)
#define ACCESSCTRL_TICKS_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_TICKS_NSU_MSB    _u(0)
#define ACCESSCTRL_TICKS_NSU_LSB    _u(0)
#define ACCESSCTRL_TICKS_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_WATCHDOG
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               WATCHDOG, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_WATCHDOG_OFFSET _u(0x000000d8)
#define ACCESSCTRL_WATCHDOG_BITS   _u(0x000000ff)
#define ACCESSCTRL_WATCHDOG_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_DBG
// Description : If 1, WATCHDOG can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_WATCHDOG_DBG_RESET  _u(0x1)
#define ACCESSCTRL_WATCHDOG_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_WATCHDOG_DBG_MSB    _u(7)
#define ACCESSCTRL_WATCHDOG_DBG_LSB    _u(7)
#define ACCESSCTRL_WATCHDOG_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_DMA
// Description : If 1, WATCHDOG can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_WATCHDOG_DMA_RESET  _u(0x0)
#define ACCESSCTRL_WATCHDOG_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_WATCHDOG_DMA_MSB    _u(6)
#define ACCESSCTRL_WATCHDOG_DMA_LSB    _u(6)
#define ACCESSCTRL_WATCHDOG_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_CORE1
// Description : If 1, WATCHDOG can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_WATCHDOG_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_WATCHDOG_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_WATCHDOG_CORE1_MSB    _u(5)
#define ACCESSCTRL_WATCHDOG_CORE1_LSB    _u(5)
#define ACCESSCTRL_WATCHDOG_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_CORE0
// Description : If 1, WATCHDOG can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_WATCHDOG_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_WATCHDOG_CORE0_BITS   _u(0x00000010)
