Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/accessctrl.h
#define ACCESSCTRL_WATCHDOG_CORE0_MSB    _u(4)
#define ACCESSCTRL_WATCHDOG_CORE0_LSB    _u(4)
#define ACCESSCTRL_WATCHDOG_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_SP
// Description : If 1, WATCHDOG can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_WATCHDOG_SP_RESET  _u(0x1)
#define ACCESSCTRL_WATCHDOG_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_WATCHDOG_SP_MSB    _u(3)
#define ACCESSCTRL_WATCHDOG_SP_LSB    _u(3)
#define ACCESSCTRL_WATCHDOG_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_SU
// Description : If 1, and SP is also set, WATCHDOG can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_WATCHDOG_SU_RESET  _u(0x0)
#define ACCESSCTRL_WATCHDOG_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_WATCHDOG_SU_MSB    _u(2)
#define ACCESSCTRL_WATCHDOG_SU_LSB    _u(2)
#define ACCESSCTRL_WATCHDOG_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_NSP
// Description : If 1, WATCHDOG can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_WATCHDOG_NSP_RESET  _u(0x0)
#define ACCESSCTRL_WATCHDOG_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_WATCHDOG_NSP_MSB    _u(1)
#define ACCESSCTRL_WATCHDOG_NSP_LSB    _u(1)
#define ACCESSCTRL_WATCHDOG_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_WATCHDOG_NSU
// Description : If 1, and NSP is also set, WATCHDOG can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_WATCHDOG_NSU_RESET  _u(0x0)
#define ACCESSCTRL_WATCHDOG_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_WATCHDOG_NSU_MSB    _u(0)
#define ACCESSCTRL_WATCHDOG_NSU_LSB    _u(0)
#define ACCESSCTRL_WATCHDOG_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_RSM
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               RSM, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_RSM_OFFSET _u(0x000000dc)
#define ACCESSCTRL_RSM_BITS   _u(0x000000ff)
#define ACCESSCTRL_RSM_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_DBG
// Description : If 1, RSM can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_RSM_DBG_RESET  _u(0x1)
#define ACCESSCTRL_RSM_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_RSM_DBG_MSB    _u(7)
#define ACCESSCTRL_RSM_DBG_LSB    _u(7)
#define ACCESSCTRL_RSM_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_DMA
// Description : If 1, RSM can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RSM_DMA_RESET  _u(0x0)
#define ACCESSCTRL_RSM_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_RSM_DMA_MSB    _u(6)
#define ACCESSCTRL_RSM_DMA_LSB    _u(6)
#define ACCESSCTRL_RSM_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_CORE1
// Description : If 1, RSM can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RSM_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_RSM_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_RSM_CORE1_MSB    _u(5)
#define ACCESSCTRL_RSM_CORE1_LSB    _u(5)
#define ACCESSCTRL_RSM_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_CORE0
// Description : If 1, RSM can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_RSM_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_RSM_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_RSM_CORE0_MSB    _u(4)
#define ACCESSCTRL_RSM_CORE0_LSB    _u(4)
#define ACCESSCTRL_RSM_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_SP
// Description : If 1, RSM can be accessed from a Secure, Privileged context.
#define ACCESSCTRL_RSM_SP_RESET  _u(0x1)
#define ACCESSCTRL_RSM_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_RSM_SP_MSB    _u(3)
#define ACCESSCTRL_RSM_SP_LSB    _u(3)
#define ACCESSCTRL_RSM_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_SU
// Description : If 1, and SP is also set, RSM can be accessed from a Secure,
//               Unprivileged context.
#define ACCESSCTRL_RSM_SU_RESET  _u(0x0)
#define ACCESSCTRL_RSM_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_RSM_SU_MSB    _u(2)
#define ACCESSCTRL_RSM_SU_LSB    _u(2)
#define ACCESSCTRL_RSM_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_NSP
// Description : If 1, RSM can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_RSM_NSP_RESET  _u(0x0)
#define ACCESSCTRL_RSM_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_RSM_NSP_MSB    _u(1)
#define ACCESSCTRL_RSM_NSP_LSB    _u(1)
#define ACCESSCTRL_RSM_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_RSM_NSU
// Description : If 1, and NSP is also set, RSM can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_RSM_NSU_RESET  _u(0x0)
#define ACCESSCTRL_RSM_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_RSM_NSU_MSB    _u(0)
#define ACCESSCTRL_RSM_NSU_LSB    _u(0)
#define ACCESSCTRL_RSM_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_XIP_CTRL
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               XIP_CTRL, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_XIP_CTRL_OFFSET _u(0x000000e0)
#define ACCESSCTRL_XIP_CTRL_BITS   _u(0x000000ff)
#define ACCESSCTRL_XIP_CTRL_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_DBG
// Description : If 1, XIP_CTRL can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_CTRL_DBG_RESET  _u(0x1)
#define ACCESSCTRL_XIP_CTRL_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_XIP_CTRL_DBG_MSB    _u(7)
#define ACCESSCTRL_XIP_CTRL_DBG_LSB    _u(7)
#define ACCESSCTRL_XIP_CTRL_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_DMA
// Description : If 1, XIP_CTRL can be accessed by the DMA, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_CTRL_DMA_RESET  _u(0x0)
#define ACCESSCTRL_XIP_CTRL_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_XIP_CTRL_DMA_MSB    _u(6)
#define ACCESSCTRL_XIP_CTRL_DMA_LSB    _u(6)
#define ACCESSCTRL_XIP_CTRL_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_CORE1
// Description : If 1, XIP_CTRL can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_CTRL_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_XIP_CTRL_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_XIP_CTRL_CORE1_MSB    _u(5)
#define ACCESSCTRL_XIP_CTRL_CORE1_LSB    _u(5)
#define ACCESSCTRL_XIP_CTRL_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_CORE0
// Description : If 1, XIP_CTRL can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_CTRL_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_XIP_CTRL_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_XIP_CTRL_CORE0_MSB    _u(4)
#define ACCESSCTRL_XIP_CTRL_CORE0_LSB    _u(4)
#define ACCESSCTRL_XIP_CTRL_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_SP
// Description : If 1, XIP_CTRL can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_XIP_CTRL_SP_RESET  _u(0x1)
#define ACCESSCTRL_XIP_CTRL_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_XIP_CTRL_SP_MSB    _u(3)
#define ACCESSCTRL_XIP_CTRL_SP_LSB    _u(3)
#define ACCESSCTRL_XIP_CTRL_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_SU
// Description : If 1, and SP is also set, XIP_CTRL can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_XIP_CTRL_SU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_CTRL_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_XIP_CTRL_SU_MSB    _u(2)
#define ACCESSCTRL_XIP_CTRL_SU_LSB    _u(2)
#define ACCESSCTRL_XIP_CTRL_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_NSP
// Description : If 1, XIP_CTRL can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_XIP_CTRL_NSP_RESET  _u(0x0)
#define ACCESSCTRL_XIP_CTRL_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_XIP_CTRL_NSP_MSB    _u(1)
#define ACCESSCTRL_XIP_CTRL_NSP_LSB    _u(1)
#define ACCESSCTRL_XIP_CTRL_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_CTRL_NSU
// Description : If 1, and NSP is also set, XIP_CTRL can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_XIP_CTRL_NSU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_CTRL_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_XIP_CTRL_NSU_MSB    _u(0)
#define ACCESSCTRL_XIP_CTRL_NSU_LSB    _u(0)
#define ACCESSCTRL_XIP_CTRL_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_XIP_QMI
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               XIP_QMI, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged processor or debug access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_XIP_QMI_OFFSET _u(0x000000e4)
#define ACCESSCTRL_XIP_QMI_BITS   _u(0x000000ff)
#define ACCESSCTRL_XIP_QMI_RESET  _u(0x000000b8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_DBG
// Description : If 1, XIP_QMI can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_QMI_DBG_RESET  _u(0x1)
#define ACCESSCTRL_XIP_QMI_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_XIP_QMI_DBG_MSB    _u(7)
#define ACCESSCTRL_XIP_QMI_DBG_LSB    _u(7)
#define ACCESSCTRL_XIP_QMI_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_DMA
// Description : If 1, XIP_QMI can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_QMI_DMA_RESET  _u(0x0)
#define ACCESSCTRL_XIP_QMI_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_XIP_QMI_DMA_MSB    _u(6)
#define ACCESSCTRL_XIP_QMI_DMA_LSB    _u(6)
#define ACCESSCTRL_XIP_QMI_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_CORE1
// Description : If 1, XIP_QMI can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_QMI_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_XIP_QMI_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_XIP_QMI_CORE1_MSB    _u(5)
#define ACCESSCTRL_XIP_QMI_CORE1_LSB    _u(5)
#define ACCESSCTRL_XIP_QMI_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_CORE0
// Description : If 1, XIP_QMI can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_QMI_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_XIP_QMI_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_XIP_QMI_CORE0_MSB    _u(4)
#define ACCESSCTRL_XIP_QMI_CORE0_LSB    _u(4)
#define ACCESSCTRL_XIP_QMI_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_SP
// Description : If 1, XIP_QMI can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_XIP_QMI_SP_RESET  _u(0x1)
#define ACCESSCTRL_XIP_QMI_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_XIP_QMI_SP_MSB    _u(3)
#define ACCESSCTRL_XIP_QMI_SP_LSB    _u(3)
#define ACCESSCTRL_XIP_QMI_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_SU
// Description : If 1, and SP is also set, XIP_QMI can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_XIP_QMI_SU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_QMI_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_XIP_QMI_SU_MSB    _u(2)
#define ACCESSCTRL_XIP_QMI_SU_LSB    _u(2)
#define ACCESSCTRL_XIP_QMI_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_NSP
// Description : If 1, XIP_QMI can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_XIP_QMI_NSP_RESET  _u(0x0)
#define ACCESSCTRL_XIP_QMI_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_XIP_QMI_NSP_MSB    _u(1)
#define ACCESSCTRL_XIP_QMI_NSP_LSB    _u(1)
#define ACCESSCTRL_XIP_QMI_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_QMI_NSU
// Description : If 1, and NSP is also set, XIP_QMI can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_XIP_QMI_NSU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_QMI_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_XIP_QMI_NSU_MSB    _u(0)
#define ACCESSCTRL_XIP_QMI_NSU_LSB    _u(0)
#define ACCESSCTRL_XIP_QMI_NSU_ACCESS "RW"
// =============================================================================
// Register    : ACCESSCTRL_XIP_AUX
// Description : Control whether debugger, DMA, core 0 and core 1 can access
//               XIP_AUX, and at what security/privilege levels they can do so.
//
//               Defaults to Secure, Privileged access only.
//
//               This register is writable only from a Secure, Privileged
//               processor or debugger, with the exception of the NSU bit, which
//               becomes Non-secure-Privileged-writable when the NSP bit is set.
#define ACCESSCTRL_XIP_AUX_OFFSET _u(0x000000e8)
#define ACCESSCTRL_XIP_AUX_BITS   _u(0x000000ff)
#define ACCESSCTRL_XIP_AUX_RESET  _u(0x000000f8)
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_DBG
// Description : If 1, XIP_AUX can be accessed by the debugger, at
//               security/privilege levels permitted by SP/NSP/SU/NSU in this
//               register.
#define ACCESSCTRL_XIP_AUX_DBG_RESET  _u(0x1)
#define ACCESSCTRL_XIP_AUX_DBG_BITS   _u(0x00000080)
#define ACCESSCTRL_XIP_AUX_DBG_MSB    _u(7)
#define ACCESSCTRL_XIP_AUX_DBG_LSB    _u(7)
#define ACCESSCTRL_XIP_AUX_DBG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_DMA
// Description : If 1, XIP_AUX can be accessed by the DMA, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_AUX_DMA_RESET  _u(0x1)
#define ACCESSCTRL_XIP_AUX_DMA_BITS   _u(0x00000040)
#define ACCESSCTRL_XIP_AUX_DMA_MSB    _u(6)
#define ACCESSCTRL_XIP_AUX_DMA_LSB    _u(6)
#define ACCESSCTRL_XIP_AUX_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_CORE1
// Description : If 1, XIP_AUX can be accessed by core 1, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_AUX_CORE1_RESET  _u(0x1)
#define ACCESSCTRL_XIP_AUX_CORE1_BITS   _u(0x00000020)
#define ACCESSCTRL_XIP_AUX_CORE1_MSB    _u(5)
#define ACCESSCTRL_XIP_AUX_CORE1_LSB    _u(5)
#define ACCESSCTRL_XIP_AUX_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_CORE0
// Description : If 1, XIP_AUX can be accessed by core 0, at security/privilege
//               levels permitted by SP/NSP/SU/NSU in this register.
#define ACCESSCTRL_XIP_AUX_CORE0_RESET  _u(0x1)
#define ACCESSCTRL_XIP_AUX_CORE0_BITS   _u(0x00000010)
#define ACCESSCTRL_XIP_AUX_CORE0_MSB    _u(4)
#define ACCESSCTRL_XIP_AUX_CORE0_LSB    _u(4)
#define ACCESSCTRL_XIP_AUX_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_SP
// Description : If 1, XIP_AUX can be accessed from a Secure, Privileged
//               context.
#define ACCESSCTRL_XIP_AUX_SP_RESET  _u(0x1)
#define ACCESSCTRL_XIP_AUX_SP_BITS   _u(0x00000008)
#define ACCESSCTRL_XIP_AUX_SP_MSB    _u(3)
#define ACCESSCTRL_XIP_AUX_SP_LSB    _u(3)
#define ACCESSCTRL_XIP_AUX_SP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_SU
// Description : If 1, and SP is also set, XIP_AUX can be accessed from a
//               Secure, Unprivileged context.
#define ACCESSCTRL_XIP_AUX_SU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_AUX_SU_BITS   _u(0x00000004)
#define ACCESSCTRL_XIP_AUX_SU_MSB    _u(2)
#define ACCESSCTRL_XIP_AUX_SU_LSB    _u(2)
#define ACCESSCTRL_XIP_AUX_SU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_NSP
// Description : If 1, XIP_AUX can be accessed from a Non-secure, Privileged
//               context.
#define ACCESSCTRL_XIP_AUX_NSP_RESET  _u(0x0)
#define ACCESSCTRL_XIP_AUX_NSP_BITS   _u(0x00000002)
#define ACCESSCTRL_XIP_AUX_NSP_MSB    _u(1)
#define ACCESSCTRL_XIP_AUX_NSP_LSB    _u(1)
#define ACCESSCTRL_XIP_AUX_NSP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : ACCESSCTRL_XIP_AUX_NSU
// Description : If 1, and NSP is also set, XIP_AUX can be accessed from a Non-
//               secure, Unprivileged context.
//
//               This bit is writable from a Non-secure, Privileged context, if
//               and only if the NSP bit is set.
#define ACCESSCTRL_XIP_AUX_NSU_RESET  _u(0x0)
#define ACCESSCTRL_XIP_AUX_NSU_BITS   _u(0x00000001)
#define ACCESSCTRL_XIP_AUX_NSU_MSB    _u(0)
#define ACCESSCTRL_XIP_AUX_NSU_LSB    _u(0)
#define ACCESSCTRL_XIP_AUX_NSU_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_ACCESSCTRL_H

